package il.ac.bgu.finalproject.server.AcceptanceTests;


import il.ac.bgu.finalproject.server.CommunicationLayer.AdminDTOs.NewPostDTO;
import il.ac.bgu.finalproject.server.Domain.Controllers.MyLogger;
import il.ac.bgu.finalproject.server.Domain.DomainObjects.UserSearchingUtils.ResultRecord;
import org.testng.Assert;
import org.testng.annotations.AfterClass;
import org.testng.annotations.BeforeClass;
import org.testng.annotations.Test;

import java.util.logging.Level;

public class newPostFromAdminTests {
    private static ServiceConnector serviceConnector;

    @BeforeClass
    public static void setup() {
        serviceConnector= new ServiceConnector();
        serviceConnector.getBridge().connectToTestDB();
    }

    @Test
    public void newGoodPostFromAdmin(){
        int x= serviceConnector.getBridge().newPostFromAdmin("publisher","דירת 2.5 חדרים קרקע בבר גיורא 21 בד'. \n" +
                "מחיר סופר הוגן- שימו לב כי תעלם מהר⏳\n" +
                "✅ 2100 לחודש.\n" +
                "✅חדשה ונדירה! מתאימה לזוג סטודנטים או יחיד/ה. לא לשותפים.\n" +
                "✅מרווחת (45 מ\"ר) עם כניסה נפרדת (!) מגינה גדולה פרטית כולל שער ננעל. \n" +
                "✅שני צעדים מכיכר האבות. 600 מטר מהאוניברסיטה. משופצת מלא כולל אינסטלציה וחשמל. איזור מלא סטודנטים.\n" +
                "✅חדר שינה ענק, סלון ומטבח בחלל אחד גדול וכיפי וחדר עבודה חמוד.\n" +
                "כולל: שני מזגנים, פלדלת, שולחן כתיבה, תנור, מקרר חדש, כיריים, שולחן בר ,תאורה לגינה, דודש, סורגים ורשתות על כל החלונות, הכנה ומקום למכונת כביסה. בחדר שינה: פרקט פורצלן, מיטה זוגית, מזרון, שידות וארון חדש לבן 6 דלתות.\n" +
                "\uD83C\uDFCB️\u200D♂️ארנונה 70 לחודש. אין ועד בית ואתם לא רואים תחדר מדרגות או תשכנים אם לא בא לכם. \n" +
                "\uD83C\uDFCB️\u200D♀️*לא* יחידת דיור ולא דירה מחולקת לכן המחיר לא כולל חשמל או מים.\n" +
                "\uD83C\uDFCB️\u200D♂️מתפנה 1 ספטמבר 2018. חוזה רגיל לשנה עד 31.8.19 . \n" +
                "⌛אפשר לבוא לראות- לתאם בפרטי או בוואטסאפ: קרן 054-7774292");
        Assert.assertTrue(x!=-1);
        ResultRecord resultRecord= serviceConnector.getBridge().ResultRecordFromDB(""+x);
        Assert.assertEquals(resultRecord.getCost(),2100);
        Assert.assertEquals(resultRecord.getNumber(),21);
        Assert.assertEquals(resultRecord.getStreet(),"שמעון בר גיורא");
        Assert.assertEquals(resultRecord.getSize(),45);
        Assert.assertEquals(resultRecord.getFurniture(),1);
        Assert.assertEquals(resultRecord.getNeighborhood(),"שכונה ד'");
    }

    @Test
    public void newPostFromAdminPhoneIsMissing() {
        int x = serviceConnector.getBridge().newPostFromAdmin("publisher", "דירת 2.5 חדרים קרקע בבר גיורא 21 בד'. \n" +
                "מחיר סופר הוגן- שימו לב כי תעלם מהר⏳\n" +
                "✅ 2100 לחודש.\n" +
                "✅חדשה ונדירה! מתאימה לזוג סטודנטים או יחיד/ה. לא לשותפים.\n" +
                "✅מרווחת (45 מ\"ר) עם כניסה נפרדת (!) מגינה גדולה פרטית כולל שער ננעל. \n" +
                "✅שני צעדים מכיכר האבות. 600 מטר מהאוניברסיטה. משופצת מלא כולל אינסטלציה וחשמל. איזור מלא סטודנטים.\n" +
                "✅חדר שינה ענק, סלון ומטבח בחלל אחד גדול וכיפי וחדר עבודה חמוד.\n" +
                "כולל: שני מזגנים, פלדלת, שולחן כתיבה, תנור, מקרר חדש, כיריים, שולחן בר ,תאורה לגינה, דודש, סורגים ורשתות על כל החלונות, הכנה ומקום למכונת כביסה. בחדר שינה: פרקט פורצלן, מיטה זוגית, מזרון, שידות וארון חדש לבן 6 דלתות.\n" +
                "\uD83C\uDFCB️\u200D♂️ארנונה 70 לחודש. אין ועד בית ואתם לא רואים תחדר מדרגות או תשכנים אם לא בא לכם. \n" +
                "\uD83C\uDFCB️\u200D♀️*לא* יחידת דיור ולא דירה מחולקת לכן המחיר לא כולל חשמל או מים.\n" +
                "\uD83C\uDFCB️\u200D♂️מתפנה 1 ספטמבר 2018. חוזה רגיל לשנה עד 31.8.19 . \n" +
                "⌛אפשר לבוא לראות- לתאם בפרטי או בוואטסאפ");
        Assert.assertEquals(x ,-2);
    }

    @Test
    public void newPostFromAdminFullAddressIsMissing() {
        int x = serviceConnector.getBridge().newPostFromAdmin("publisher", "דירת 2.5 חדרים קרקע בבר גיורא בד'. \n" +
                "מחיר סופר הוגן- שימו לב כי תעלם מהר⏳\n" +
                "✅ 2100 לחודש.\n" +
                "✅חדשה ונדירה! מתאימה לזוג סטודנטים או יחיד/ה. לא לשותפים.\n" +
                "✅מרווחת (45 מ\"ר) עם כניסה נפרדת (!) מגינה גדולה פרטית כולל שער ננעל. \n" +
                "✅שני צעדים מכיכר האבות. 600 מטר מהאוניברסיטה. משופצת מלא כולל אינסטלציה וחשמל. איזור מלא סטודנטים.\n" +
                "✅חדר שינה ענק, סלון ומטבח בחלל אחד גדול וכיפי וחדר עבודה חמוד.\n" +
                "כולל: שני מזגנים, פלדלת, שולחן כתיבה, תנור, מקרר חדש, כיריים, שולחן בר ,תאורה לגינה, דודש, סורגים ורשתות על כל החלונות, הכנה ומקום למכונת כביסה. בחדר שינה: פרקט פורצלן, מיטה זוגית, מזרון, שידות וארון חדש לבן 6 דלתות.\n" +
                "\uD83C\uDFCB️\u200D♂️ארנונה 70 לחודש. אין ועד בית ואתם לא רואים תחדר מדרגות או תשכנים אם לא בא לכם. \n" +
                "\uD83C\uDFCB️\u200D♀️*לא* יחידת דיור ולא דירה מחולקת לכן המחיר לא כולל חשמל או מים.\n" +
                "\uD83C\uDFCB️\u200D♂️מתפנה 1 ספטמבר 2018. חוזה רגיל לשנה עד 31.8.19 . \n" +
                "⌛אפשר לבוא לראות- לתאם בפרטי או בוואטסאפ: קרן 054-7774292");
        Assert.assertEquals(x ,-3);
    }

    @Test
    public void newPostFromAdminFullOneline() {
        int x = serviceConnector.getBridge().newPostFromAdmin("publisher","רחוב מצדה 6 טלפון 0533391800");
        Assert.assertEquals(x ,-3);
    }

    @Test
    public void checkgson(){
        MyLogger.getInstance().log(Level.SEVERE,"jkjhhj");
//        String s= "{\"publisherName\":\"גשדגדש\",\"messege\":\"\\r\\nמפנה את החדר שלי בדירה הכי קרובה לאוניברסיטה- רגר 105 \uD83D\uDE0A\\r\\nבדירה נשארים Nofit Drihem Saar Yazdi והם מחפשים שותפה!\\r\\nדירת 4 חדרים, קומה שניה, ממש מול האוניברסיטה.\\r\\nהדירה מרוהטת ב100%  כל הריהוט בחדר, סלון, פינת אוכל, טלוויזיה, מכונת כביסה... \\r\\nסלון ענק, פינת אוכל ענקית, מטבח ענק. \\r\\nכל התענוג הזה ב1050  אין מחיר כזה על רגר!! \\r\\n* כניסה באוגוסט\\r\\n* מסיימת שנה א' ומעלה\\r\\n* לא מעשנת\\r\\nלפרטים ולתיאום- בפרטי או בטלפון 0523782638\",\"tokenDTO\":{\"userName\":\"admin\",\"password\":\"123456\"}}";
////        Gson gson = new Gson();
//        NewPostDTO newPostDTO = NewPostDTO.fromJSON(s);
//        System.out.println(newPostDTO.getPublisherName());
//        System.out.println(newPostDTO.getMessege1());

    }

//    @Test
//    public void insertALot(){
//        serviceConnector.getBridge().disconnectToTestDB();
//        serviceConnector.getBridge().newPostFromAdmin("shlomi arzi","השותפה המקסימה שלנו Yarden Peretz עוזבת את הדירה. אני וGal Ben Maman מחפשים מישהי שתחליף את מקומה בחדר. דירת 4 חדרים חדשה משופצת לחלוטין עם חצר ענקית. הדירה באלעזר בן יאיר 16 כרבע שעה מאוניברסיטה. הדירה מרוהטת ויש בה הכל, רק להביא בגדים ולהכנס. עלות 1150 ש\\\"ח. כניסה מיידית :)\\nלפרטים:\\n0526516656\\n");
//        serviceConnector.getBridge().newPostFromAdmin( "yoni bloch","להשכרה ללא עמלת תיווך! בשכונה ה', מגדלי עופר, רחוב ש\\\"י עגנון. דירת 5 חדרים יפה, גדולה ומרווחת. מטבח גדול, פינת אוכל מוגדרת, סלון מרווח חדרי שינה גדולים 3 שירותים 2 מקלחות יחידת הורים. בניין שמור נקי ומטופח עם 2מעליות ו 2 חניות פרטיות. גישה לנכים, מעולה למשפחה גדולה, שכ\\\"ד 4000 ש\\\"ח, כניסה מיידית! לפרטים נוספים נא ליצור קשר בנייד: 054-5533351 יריב. כניסה מיידית!\\" );
//        serviceConnector.getBridge().newPostFromAdmin( "omer adam","למכירה בשכונה ד ברחוב דוד המלך חדר וסלון 50 מ\\\"ר קומה 3/4\\nבמחיר חסר תקדים רק 480.000 ש\\\"ח הדירה נמצאת בקרבת האוניברסיטה מרחק הליכה ברגל 8 דקות\\nלפרטים נוספים וסיור בנכס\\nתיווך אדיר - אדיר 0506796969\\n" );
//        serviceConnector.getBridge().newPostFromAdmin("dani shovevani"," \"לסטודנטים שנזכרו מאוחר!\\nרגר 163\\n4 חדרים\\n100 מ\\\"ר (לפי טופס ארנונה)\\n3300 ש\\\"ח\\nדירה מרווחת מאוד ומפנקת,מול גן סיאטל,קומה  4(לא על עמודים),הדירה מאובזרת במכונת כביסה חדשה, תנור משולב עם כריים,מקרר ומרוהטת מלא למעט 2 מזרונים.\\n*ללא עמלת תיווך לסטודנטים\\nאיציק 0547334682 *עדיפות לוואטסאפ!\\nאיציק ויהב- מתווכים\\n\",\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ben arzi","להשכרה 3 חד' בשכונת יא' ברחוב שיטרית קומה 3 מ4\nללא ריהוט כניסה 1/12\nרק 1900 שח\n0503403041 עופר\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "avichai yadin","יחידת דיור 2 חדרים להשכרה בשכונה ב' רחוב בצלאל 20 חמש דקות הליכה למכללת סמי שמעון וקרובה מאוד למרכז חן. היחידה מרוהטת. 2150 כולל מים וארנונה וחשמל עד 150 שח לחודש. לכניסה מיידית .\n" );
//        serviceConnector.getBridge().newPostFromAdmin("faisel molich","דירה לאחר שיפוץ מלאאא!!!\nדירת 4 חדרים מקסימה ברחוב אברהם אבינו 26, שכונה ד' במרחק של 7 דקות הליכה משער רגר. מתאימה ל-2 שותפים או לזוג שרוצה להתפנק ?? הדירה מרוהטת קומפלט (מקרר,מיקרוגל,תנור,כיריים,מטבח חדש,מזגנים חדשים, סלון,שולחנות לימוד,שולחן פינת אוכל וכיסאות, מיטות וארונות).\nמיקום מרכזי, מול מרכז קניות, תחנת אוטובוס מתחת לבית וקרוב לאזורי הבילויים.\nשכ\"ד-2400 ש\"ח.\nזמין בפרטי\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ronen harazi","דירת 3 חדרים ברגר\n₪2,500 - ‎אוניברסיטת בן-גוריון בנגב‎\n\nלהשכרה דירת 60 מטר ברגר 163\nשמורה\nחדרים מרווחים\nסלון מרווח\n-חצר\n-ריהוט לפי הדרישה\n-כניסה מיידיצ\n-2500\n-לתיאום-0525447662\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ben aflalo","דירה יפייפיה להשכרה\nברחוב גוש עציון 25\n8 דקות הליכה מהאוניברסיטה\n2 חדרים 35 מ\"ר\nחצר פרטית עם חניה 60 מ\"ר\n2000 ש\"ח כולל מים וארנונה\n050-8693633\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dor malol","?????? הקשיבו הקשיבו ??????\nבית החלומות נמצא ממש פה מהרו לפני שלא ישאר מקום !!!\nסמטת יהונתן מיקום פצצה !!!\nדירת   4 חדרים יפייפיה משופצת מהייסוד! מוארת ונעימה !\nמרוהטת קומפקלט!\n מה יש בה ?\n? חדרים ענקיים בכל חדר יש מיטה ארון ושולחן\n ? מטבח יפייפה וגדול\n ? טלוויזיה\n ? פינת אוכל בנפרד\n ? שירותים + מקלחת\n ? שירותים בנפרד נוספים\n ? מכונת כביסה\n ? תנור\n1100 לשותף\n# נמצאת בשכונה ד' רחוב סמטת יהונתן על גבול ב'\nדירה ברמה גבוהה רק נשאר להביא בגדים ולהכנס ?\nלתיאום ושאלות נוספות מוזמנים ליצור קשר במספר הבא\n 054 - 2818529 רננה\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dikla green","דירת 4 חדרים משופצת ומרוהטת במשעול יודפת כניסה מיידית לפרטים נוספים רועי 0544218258\n" );
//        serviceConnector.getBridge().newPostFromAdmin("shalom asyag","יחידת דיור להשכרה בשכונה א\n1850 ש\"ח כולל מים וארנונה\nרחוב אוסישקין 2\nקומה 4 מתוך 4\n30 מ\"ר\nמשופצת\nכניסה ב1/10\n2 חדרים\nמרוהטת: מיטב זוגית, שידה, שידת טואלט ומראה, סלון, שולחן וכיסא,\nמקרר, כיריים, מכונת כביסה, שני מזגנים.\n4 דקות הליכה מסמי שמעון\n050-8693633\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "nimrod shoval","דירת 2.5 חד' מרווחת 50 מטר פלוס גינה במכתשים 22\nמרוהטת קומפלט מיטה זוגית\nכל מכשירי החשמל (תנור משולב עם כיריים גז, מקרר, מכונת כביסה)\nארון קיר בעל בית דואג להכול היחידה עברה שיפוץ מרחק הליכה לאוניברסיטה.\n\nמתאימה לזוג סטודנטים או זוג עם ילד מחיר לדירה 2500 כולל כול החשבונות למעט חשמל טלפון ליצירת קשר איוון :0542033228\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ron doron","מפרסמת בשביל בעל הבית:\nלהשכרה דירה בווילות מצדה :4 חדרים+ מרפסת ענקית, משופצת ומרוהטת קומפלט. מחיר 3,000 ש\"ח לא כולל חשבונות.\nכניסה ב20.11.2017.ללא בעלי חיים! לפרטים מבקשת ליצור קשר עם בעלי בית: 052-3783637\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "nofar naftchi","**אמ:לק; נשאר חדר יחיד ב-1050 ש\"ח בשכונה ב, ביאליק 24**\nבשכונה ב' השקטה והחביבה מתפנה חדר בדירת 5 חדרים גדולה ומרווחת, רח' ביאליק 24 בבניין יפהפה וצעיר (יחסית :) ) עם 2 מעליות, מקלט בקומה וחניה פרטית. כרגע בדירה 3 שותפות שמחפשות את הרביעית המשלימה!\nבדירה - סלון ומטבח ענקיים, חדר שירות, ומרפסת קטנה וחמודה!\nקיים מזגן בכל חדר שינה וכן מזגן גדול בסלון. ריהוט חלקי (מיטה וארון) בחדרים, סלון מלא כולל פלזמה, ומטבח מרווח ומפנק לחובבי הבישול - כולל תנור, כיריים ומקרר חדש.\n*הדירה ממוקמת מעל מרכז חן/ביאליק, הכולל מכולת, ירקן, מאפיה, פיצריה ויש אוטובוסים לכל מקום לעצלנים *\nמבחינת מרחק מהאוניברסיטה - בהליכה מדובר בכרבע שעה עד 20 דקות. באופניים 5-7 דקות, וכאמור יש תחנת אוטובוס מתחת לדירה שמגיעה לאוניברסיטה.\nלסטודנטים בסמי והמכללה הטכנולוגית - אפשר לקום 5 דקות לפני תחילת השיעור ועוד להספיק לקפה.\nבדירה שומרים כשרות.\nכניסה מיידית.\nלתיאום מראש להגעה - יש ליצור קשר בפרטי.\nאו בניידים:\nשיר-0545446792\nכרמל-0543055096\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "tamir shmilovich","דירה להשכרה!\nויינגייט 12...\nדירה גדולה ומרווחת... 3 חדרי שינה שירוקלחת ושירותים נוספים\nמתאימה מאד ל3 שותפים.\nקרובה מאד לרכבת צפון ולכניסה הצפונית לאוניברסיטה.\nכולל ריהוט מלא בכל החדרים - שולחן, מיטה וארון בכל חדר!\nשכ\"ד 2700 ש\"ח\n054-9435353\nמראים היום ב21:30\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "shavit chernihov","להשכרה דירה חדשה מהניילונים!!!\nפרויקט חדש של ארזי הנגב ברמות בן 5 חודשים רח' גדעון האוזנר ברמות דירת 4 חדרים + מרפסת 14.5 מטר\nקומה 3 מתוך 5\nתקרה גבוהה 3.20, מטבח משודרג של PANEL\nדלתות פנדור לבנות, רשתות + תריסים חשמליים בכל הבית, ממוזגת, חניה, מעלית ופינת אוכל מוגדרת.\nרק 2 דיירים בקומה, ללא שטחי מסחר מתחת!\nקרובה לבתי הספר ובקרבת הגנים, יציאה מהירה לכביש תל אביב ולכביש 6\nכל הקודם זוכה, כניסה מיידית!\nשכירות 3800₪\nוועד בית 240₪\nארנונה 940₪\n\nלפרטים נוספים אך ורק בנייד:\n054-320-6958\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "omer shoshan","להשכרה בשאול המלך 141\nדירת 2 חדרים יפהפייה, משופצת ומרוהטת קומפלט (ספות, שולחנות, מיטה זוגית, ארונות קיר, תנור, מקרר, מכונת כביסה, מזגן, וכל מה שצריך).\nהמחיר - 1900 לחודש כולל מים, ארנונה וועד בית\nלפרטים - 0522353174 זיו\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "naor ashkenazi","להשכרה בשכונה ה בני אור 40 קומה 3 מתוך 5 ללא מעלית, דירה גדולה ומרווחת.\nדירת 4 חדרים שלושה חדרי שינה, וסלון + חדר ארונות בנוסף ישנה מרפסת שירות.\nדירה מרווחת, מתאימה לשותפים או למשפחה, ריהוט חלקי\nמחיר: 2900 ש\"ח\nלפרטים:\nאביבית - 0502225392\nאבי - 0507289757\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "liron feliss","*** דירה ליחיד/ זוג ב1700 ***\n\nדירה מקסימה כ-35 מ\"ר בארלוזורוב 14- 10 דקות מהאוניברסיטה ומסורוקה.\nבדירה חדר שינה גדול הכולל מיטה זוגית, ארון ושידה.\nבסלון- ספה, מכונת כביסה, כיריים חשמליות, מקרר, שולחן אוכל.\nבנוסף יש מרפסת קטנה מיוחדת עם מתלה כביסה ושימושים אחרים ??\nכניסה מידית.\nלפרטים נוספים ותיאום מראש:\nספיר- 0505359900 (זמינה בוואטאפ)\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dafna armoni","מראים את החדר היום בערב !\nמתפנה חדר באלעזר בן יאיר במחיר 1150 ש\"ח הדירה חדשה, חצר מדהימה ו2 שותפים לא פחות ממושלמים לפרטים נוספים בפרטי??\n" );
//        serviceConnector.getBridge().newPostFromAdmin("shlomi shabat","השותפה שלי החליטה לפרוש מהלימודים בבש ברגע האחרון, אז אנחנו מחפשות שותפה חדשה..\nמדובר על דירת בנות מקסימה בביאליק 24, דירה ענקית 160 מר 5 חדרים, מתאים ל4 שותפות...\nאנחנו מחפשות משהי שומרת כשרות עם ראשון טוב ??\nאם אתן מכירות משהי מתאימה תתיגו:))\n**תמונות ופרטים נוספים בפרטי**\nכרמל 0543055096\n" );
//        serviceConnector.getBridge().newPostFromAdmin("shlomi shaban","להשכרה יחידת דיור 3 חד' קרקע עם גינה וכניסה פרטית\nברח' הכותל המערבי בשכונה א'\nריהוט מלא כולל הכל כניסה מידית\nמתאים ליחיד או זוג ללא בעלי חיים\nהמחיר 3000 כולל ארנונה ומים\nלפרטים רונן 050-5300038\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "nichal yanai","#חדשה_להשכרה! ??\nיחידת דיור מדהימה בשכונת נאות לון!\nכ-80מ\"ר בנוי, 2חדרים (חדר שינה גדול עם חדר ארונות + סלון מרווח מאוד), גינה של כ-40מ\"ר. #ריהוט_מלא!\n*ללא חיות מחמד\n3,500ש\"ח כולל הכל! חשמל, מים, גז, ארנונה, אינטרנט ו-yes.\nלפרטים נוספים : 054-3037805 נתי - ארץ עיר\nארץ עיר - נדל\"ן ויזמות\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "oded menashe","להשכרה דירת 2 חד'\n\nשכונה ד', רח' בר גיורא\n\n*ממוזגת\n*קומת קרקע\n*50 מ\"ר\n\nריהוט: בסיס מיטה + מזרן, מקרר, ארון 3 דלתות.\n\nכניסה מיידית.\n\nמחיר: 1,700 ש\"ח.\n\nלפרטים: 054-449-0025\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "roth sirkis","מפנה חדר אלעזר בן יאיר במחיר 1150 , משאירה אחריי שתי שותפים מדהימים הדירה חדשה ואחרי צבע לפרטים נוספים בפרטי??\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "yosef ben david","עקב קבלה ללימודים במוסד מרוחק אני נאלצת לעזוב את הדירה ומחפשת שותפה שתחליף אותי בחדר, המחיר הוא 1150 לחודש וכמובן 2 שותפים מדהימים!!! לעוד פרטים בפרטי??\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dan doron","מחפשת בשביל חברה שותף/ה בראש טוב! לדירה במצדה 43, קומה ראשונה (מעל הפסטינה) לשני שותפים, דירה גדולה ומשופצת, מרווחת,  במצב טוב, מתפנה חדר גדול ונחמד. בחדר נשארים שני ארונות ומדפים אבל חסרה מיטה. שכ'\"ד 2,400.\nמחפשת שותף/ה שרוצים לגור באווירה טובה, קלילה וחברית..\nלפרטים 0525834867 נוי\n" );
//        serviceConnector.getBridge().newPostFromAdmin("bibi netanyhau","להשכרה : דירת 2.5 חד' קומה 4/4,משופצת מרוהטת ממוזגת.\n60 מטר ברחוב מבצע עובדה\n2000 ש\"ח.\nכניסה 15.10\n\"פרי נכסים\"\n0508812541\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "achmed tibi","***רינגלבלום 7***\nדירת 2 חד' 50 מ\"ר משופצת ומרוהטת עם מרפסת פנימית\nמתאימה לזוגות או ליחידים\nממש על הכניסה לרחוב בן מתתיהו ומטר מרגר\nרק 2000 ש\"ח!!\nאיתי 050-2516898\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dafna briliant","דירה להשכרה ברחוב רגר 126 (צמוד לרח׳ רינגנבלום) 3 חדרים ,משופצת כחדשה, קומת קרקע, כולל מרפסת (גינה -אפשר בעלי חיים) +מחסן. מאובזרת במוצרי חשמל רובם חדשים: מכונת כביסה, מקרר, כריים, תנור ,2 מזגנים וטוסטר אובן. מקלחת ושירותים חדשים, מטבח חדש .ארונות ומיטות זוגיות בחדרי השינה. לבית 2 כניסות אחת מהמרפסת והשניה מחדר המדרגות. 2 דקות הליכה מהאוניברסיטה (בקרבת שער 90 )\n2600 שח.\nלפרטים: 0525411144\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "yoel solomon","?דירה להשכרה הכי יפה בשכונה ג?\n₪ 3,300\nבאר שבע\nשכונה ג- דירת 4 חדרים- 1100 ש\"ח\nהדירה הכי יפה בשכונה ג'!\nדירת 4 חדרים, עברה שיפוץ קומלפט- הכל חדש!\nבנוסך, הדירה מרוהטת קומפלט! (בכל חדר: מיטה+ שולחן + כסא+ ארון+ מזגן- הכל חדש)\nבחלל המשותף: ספה, שולחן, שידה, LCD, מזגן, פינת אוכל, מכונת כביסה, מקרר, מיקרו, תנור, כיריים- הכל חדש מהניילונים!\nאמיר מנצור - יועץ נדל\"ן באר-שבע 360\nלתיאום - 054-5514300\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ronit pik","*********ללא תיווך!!************\nדירה להשכרה בשכונה ה' המתחדשת!!\nמילוס 12, קומה 2, 3 חדרים, ממוזגת, מטבח,מקלחת + שירותים משופצים. מתאימה למשפחות ושותפים.\nהדירה לא מרוהטת!\nישנה דרישה לצ'קים + ערב!\nשכ\"ד 2300 ש\"ח.\nלתאום נא ליצור קשר\nמקסים 052-345-7591\nאלי: 052-4848-414 { עדיפות לווטאסאפ }\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "zvika pik","דירה ענקית מוארת ומרווחת (96 מ\"ר) בת 3 חדרים (מרוהטת) מיועדת  לזוג סטודנטים, יחיד או משפחה. 2 חדרי שינה, סלון, חדר ארונות, מקלחת, שירותים, מרפסת שירות ומרפסת גדולה שמתחברת לסלון ולחדר.\nחניה פרטית לתושבי הבנין .\nשדרות שזר 19 שכונה ג' ,\n2 דק הליכה לבית הספר למשחק ,\nקרובה לאוניברסיטה למרכזי קניות ותחנת רכבת.\nמרוהטת . מטבח ומקלחת אחרי שיפוץ !\n2200 שקלים סה\"כ\nלשאלות ותיאומים - יובל - 052-470-8798\nמנחם- 050-6233-437\nהמשך יום טוב :)\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "boris klaiman","***מחפסת שותפים!!***\nסטודנטית מעוניינת בשני שותפים/שותפות נוספים,לדירת 5 חדרים מקסימה במבצע נחשון 76, צמוד למרכז גילת. (סהכ 3 שותפים)\n\n2 חדרים פנויים :\nחדר אחד עם שירותים ומקלחת פרטיים ( לחדר 1000₪)\nחדר נוסף עם מרפסת פרטית ונוף יפה. (לחדר 1100₪)\n\nדירה גדולה ומרווחת עם מטבח\nמאובזר (הרבה ארוחות שישי שוות) סלון מפנק וגדול עם מרפסת צמודה, חנייה פרטית ובריכה מקורה(כרגע לא בשימוש)\n\nמחפשת שותפים רציניים עם אנרגיות חיובית??\n\nאם מעניין אותכם שלחו לי בפרטי:\n0586823161\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "shavit elimelech","***כניסה במיידי***\n$$$גמישות במחיר$$$\nשתי שותפות מחפשות שותף/ה בבית קרקע מדהים??\n*בית קרקע שממוקם ברחוב האיסיים 16 בשכונה ד'.\n*3 חדרי שינה, סלון מאובזר ושירוקלחת ??\n*מרוהטת באופן מלא! שופצה בקיץ האחרון :)\n*שתי חצרות מקורות! (לישיבות בחורף בלי גשם) ?????\n*3150₪ לכל הבית! ??\n*בעל דירה אכפתי\n*כניסה מיידית!\nלפרטים: יער 0549747552\nVeronika Davidov 0543112881\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "shlomit soka","לרציניים בלבד, אני מפרסם את הדירה בשם בעל הבית,\nהדירה מתאימה לזוג או 2 שותפים,\n2500 ש\"ח כולל ארנונה\nעם 3 מזגנים מעולים וחסכוניים של אלקטרה אחד בכל חדר,\nארונות מטבח חדשים,\nדוד שמש סולארי,\nחלונות עם סורגים,\nחנייה בשפע,\nיש מרכול שכונתי קרוב לבית,\nהדירה קרובה למעון ילדים,\nהמחיר חודשי לא כולל מים וחשמל,\nתשלום לפי צריכה של מונה חשמל ומים פעם בחודשיים.\nגודל הדירה כ62 מ\"ר, החצר סגורה עם גג בגודל כ15 מ\"ר.\nליצירת קשר לשלוח לי הודעה בפרטי.\nהדירה נמצאת ברחוב אסירי ציון, שכונה ג' בבאר שבע\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "zevik pevik","בבאר שבע להשכרה במגדל הספורט החדש מול ביה\"ח סורוקה ובקרבת האוניברסיטה דירת 2 חדרים מרוהטת בקומה 7 כניסה 15.11.17 שכירות 2700 ש\"ח לתיאום יאיר 0528683499\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "john ogo","ללא עמלת תיווך! להשכרה ברחוב דויד המלך 31 דירת 3 חדרים יפייפיה גדולה ממוזגת,מרווחת ומרוהטת, התקנה של מטבח חדש בשלבי סיום, סלון גדול חדרי שינה גדולים מטבח פונקציונלי במרחק 10 דקות הליכה לאוניברסיטת בן גוריון מעולה לשותפים סטודנטים. כניסה מיידית!\nשכ\"ד 2100 ש\"ח!\nלפרטים / תאום: 054-5533351 יריב.\n" );
//
//        serviceConnector.getBridge().newPostFromAdmin( "srolik prolik","\"דירה מרוהטת ?? משופצת ?? ליד האוניברסיטה??\\n??מראה את הדירה היום בתיאום מראש??\\n\uD83D\uDCF1לפרטים: תומר 054-5918161\\nמתאימה ל-3 שותפים. \uD83D\uDCA5החל מ-850 ש\\\"ח לחדר!\uD83D\uDCA5\\n??דירה משופצת מן היסוד בקומה שנייה, מאווררת ומרווחת (70 מ\\\"ר) :\\n??מרוהטת: בכל חדר מיטה, מזגן, ארון, שולחן כתיבה וכיסא\\n??מקרר, כיריים, מכונת כביסה ועוד\\n??11 דק' הליכה מהאוניברסיטה\\n??1 דקה הליכה מ\\\"בר גיורא\\\" ו5 דק מהפאבים/מסעדות במצדה.\\n?? רק 850-950 ש\\\"ח לחדר\\nבבר גיורא פינת רבי-עקיבא\\n\"" );
//        serviceConnector.getBridge().newPostFromAdmin( "arnon sturm","דירה מתאימה לזוגות/יחיד- זיסו 7!!!\n\nזיסו 7 (בקרבה לאוניברסיטה) קומה 1 בבית פרטי (ללא גינה) בשכונה ג'. 42 מ\"ר.\nדירת 2 חדרים משופצת ומרוהטת, כולל: מקרר, כיריים גז, סלון, ארון, מזגנים, מיטה, שולחן למידה.\n\nכניסה מיידית!\nשכ\"ד: 1700 כולל ארנונה.\nמותר בעלי חיים!\n\nלפרטים ותיאום הגעה: בן - 050-5470703\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "yosi yosi","להשכרה!!\nמתפנה, דירה משופצת ברמה גבוהה, מוארת מאוד (כולל חלונות, ריצוף, מטבח, מקלחת, שירותים, צנרת, מזגנים) מתאימה ל 3 שותפים ביצחק שיפר 4 קומה רביעית. במיקום מעולה, 9 דקות הליכה מהאוניברסיטה משער 90, קרובה לתחבורה ציבורית למרכז מסחרי. הדירה נעימה ומרוהטת. פירוט הריהוט - מקרר חדש , מכונת כביסה חדשה , מזגן חדש, תנור וכיריים, מיקרוגל, שולחן פינת אוכל+ כיסאות, ספות + שולחן בסלון. בכל חדר מיטה מזרן, ארון שולחן. מזגן בכל אחד משלושת החדרים + סלון.\nהמחיר 1,100 ש\"ח לשותף. כניסה מיידי.\nלפרטים: דורון 054-7541707\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "avi hayun","** דירת 3 חדרים מרווחת **\nדירה גדולה עם סלון גדול, ושני חדרי שינה שווים בגודלם\nמתאימה לשותפים, לזוג ולמשפחה\nקרובה מאוד למכללת קיי, ומרחב נסיעה של כ- 10 דק' מהאוניברסיטה\nריהוט כמעט מלא\nכתובת: בעלי התוספות 22, שכונה ד'\nמחיר: 2000 ש\"ח\nפרטים נוספים בפרטי\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dudu namer","מראה היום ב17:00 להשכרה דירת 3 חד'\nבשכונה ט' רחבת צפת קומה 2\nבבניין מסודר עם מעלית לכניסה מיידית\n2700 שח 0503403041 עופר\n" );
//        serviceConnector.getBridge().newPostFromAdmin("rami gershon","דירת 3 חדרים לכניסה ביום שלישי\n₪2,500 - ‎אוניברסיטת בן-גוריון בנגב‎\n\nלהשכרה כניסה מיידית!\n-דירת קרקע בשכונה ד' על רחוב אברהם אבינו-כיכר האבות\n-חצר פרטית\nשירותים ומקלחת בחדר\n-ריהוט מלא וחדש\n-0525447662\n-2500 לכל הדירה (2 שותפים)\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "shimon gershon","*** דירה משופצת ליחיד/לזוג במקום מרכזי רק ב1700**\n\nדירה מקסימה כ-35 מ\"ר בארלוזורוב 4/4 קומה שנייה.\nמתחת לדירה- מאפיה, מכולת, תחנת אוטובוס, 7 דקות מסורוקה ו10 דקות מהאוניברסיטה.\nבנוסף יש גם מרפסת מגניבה ??\nהדירה מרוהטת חלקית אך בעל הדירה גמיש לעזרה.\nכניסה- ב1.11.\nלפרטים נוספים ותיאום מראש- זמינים בוואטאפ:\nספיר- 0505359900\nשירן- 0507914455\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ben caspit","יחידת דיור יפהפיה,\nמשופצת מהיסוד,\nברחוב שאול המלך 93,\nשכונה ו' החדשה,\nמרוהטת קומפלט ומאובזרת,\nקומה 4.\nכניסה מיידית.\nשכ\"ד 2300 כולל ארנונה ומים.\nלפרטים- אדוארד 0503133399\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dalia rabinovich","רק 800 ש\"ח לשותף בדירת 3 שותפים!\nכל הדירה פנויה.\n4 חדרים ברחוב משעול ביתר- מרחק 12 דקות הליכה מהאוניברסיטה.\nכל החדרים מרוהטים - מיטה, ארון ושולחן כתיבה. באחד החדרים יש מרפסת.\n85 מ\"ר.\nשכ\"ד לכל הדירה- 2400 ש\"ח.\nכניסה מיידית.\n0503133399\n" );
//        serviceConnector.getBridge().newPostFromAdmin("yosi aboksis","לטודנטים ,קרוב לוינגייט,דירת קרקע,+ מרפסת עצומה וחצר בדו קומתי, קלישר דירת 4 חדרים +שני חדרי שירותים ,הדירה מרווחת ומוארת אחרי שיפוץ ,מרוהטת מלא, במרחק הליכה של כ- 7 דקות להאוניברסיטה, למרכז הספורט של האוניברטיטה ולתחנת הרכבת .ולסורוקה.מתאימה ל-3 שותפים או לזוג\n.דמי השכירות : 2950 ש\"ח לפרטים: לנייד 0545634377\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "shachar hirsh","****מראים היום, תאום בפרטי *********\nהשכרה ,ללא תיווך ,בבר גיורא 9 ,שכונה(ד'), דירת גן,אפשר בע\"ח.\nדירת גן עם חצר לזוג/שותפים, 3 חדרים + שרותים ומקלחת בכל חדר.\nהדירה לאחר שיפוץ מלא כולל אינסטלציה , חשמל, ריצוף(גרניט פורצלן) , מזגנים בכל החדרים , ריהוט , מקלחונים , סורגים , פלדלת, דוד שמש וחשמל.\nבסלון- פינת אוכל וכסאות, מקרר, כיריים גז,\nבחדרים- בסיס מיטה זוגית וארון בכל חדר .\nשכד 2200, כולל חצי מחשבון חשמל !. פרטים נוספים בפרטי.\nהגינה פרטית ומגודרת .\nכניסה 1/10\nנא לתאם בפרטי\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "niv sela","לכניסה מיידית ל3 שותפים\n₪1,100 - ‎אוניברסיטת בן-גוריון בנגב‎\n\nלכניסה מיידית דירת 4 חדרים בשכונה ד' על גבול ב'\nרחוב סמטת יהונתן ל3 שותפים\n1100 לשותף\nמרוהטת קומפלט\nכמו בתמונות\n-לתיאום 0525447662\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "omer sela","להשכרה דירת 4 חדרים משופצת ביעקב דורי 13 ב״ש. ללא תיווך!\n***3000 לכל הדירה -מתאימה ל3 שותפים***\n קומה 3/4 בלי מעלית כולל מחסן פרטי בקומת קרקע.\nהדירה מרווחת ומרוהטת לגמרי, הכל חדש! מכונת כביסה, גז, מקרר, ספה, ארונות, מזגן בכל חדר, טלוויזיה ״43 , מיטות ומזרנים.\n לכניסה מיידית\nלפרטים נוספים אייל 0506533911\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dani danon","להשכרה בשכונת ו' החדשה!\n??ללא עמלת תיווך!!!??\n\nברחוב מבצע נחשון (בפינת הרחובות מצדה - יהודה הלוי)\nדירת 4 חד'\n90 מ\"ר\nקומה 4\n???משופצת ומרוהטת\n???ממוזגת (מזגן בכל חדר ובסלון)\n???בניין מסודר ונקי עם ועד בית\nהדירה קרובה להכל (ממש במרכז העיר!!)\n\nמחיר ?? 2700 ש\"ח\nלפרטים נוספים ולתאום\n????????????????\n053-2787802\n" );
//        serviceConnector.getBridge().newPostFromAdmin("roni rahav","חדשה להשכרה בבלעדיות\n\n??במגד העיר\n??דירת 5 חד'\n??חדשה מקבלן\n??2סוויטות הורים\n??מרפסת שמש\n??מחסן\n??מגדל יוקרה.לובי ברמה גבוהה\n??חדר כשר בבנין\n??ממול בית חולים סורוקה\n??כמה צעדים ממרכז הנגב\nחובה לראות\nלפרטים וסיור בנכס: מאגר נכסים\nגולי אזולאי נציגת שרות  0503336803??\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "yair role","*** להשכרה***\nדירהת 2 חדרים משופצת ברחוב גיורא יוספטל 26 בכניסה של באר שבע מצפון בסמיכות למרכז אורן 7 דקות הליכה מהאוניברסיטה סביבה שקטה מתאימה לזוג ו\\או לשני שותפים ,משופצת במלואה, מחיר 1700 ש\"ח.\nבדירה יש מקרר,שולחן מתקפל פינת אוכל,כיריים חשמליות וגז ,ארון קיר דלתות כפולות,מיטה זוגית,שידת טלויזיה +כונניות,מזגן, 2 ספות ושולחן\nאמנון -054-3406666\n" );
//        serviceConnector.getBridge().newPostFromAdmin("shavit tamir", "להשכרה ללא עמלת תיווך! שכונה ה' רחוב טבנקין דירת 3 חדרים 84מ\"ר ק.1. סלון גדול, מטבח גדול וחדש, חדר רחצה חדש, חדרי שינה מרווחים בדירה יש שני ארונות בגדים כל השאר ללא ריהוט! דירה מדהימה, יש חניה עם גישה נוחה, שכ\"ד 2500 ש\"ח כניסה בינואר 2018 פרטים נוספים בנייד:\n054-5533351 יריב.\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "tamir nofar", "שלום לכולם,\nמחפש שותף לדירה ליד שער 90 חצי דקה מהאוניברסיטה\nממש ליד השניצלה\nהדירה במצב מעולה, נקייה, גז תנור מקרוגל מחסן טלוויזיה וממיר וכמובן מכונת כביסה. הכל מוכן.\nבעלת דירה נחמדה, כניסה מיידית עד אוקטובר\nלפרטים 0546310727\n");
//        serviceConnector.getBridge().newPostFromAdmin( "user one", "להשכרה (ללא תיווך) דירת 5 חדרים חדשה ומושקעת מאביסרור ברמות החדשה, קרוב ליציאה מהעיר, קומה 5 עם מעלית .\nהחדרים כוללים יחידת הורים וחדר מתבגר/אורחים עם מקלחת ושירותים צמודים. מטבח משודרג, דלתות פנדור מעוצבות בכל הדירה, מזגנים בכל החדרים, מרפסת שמש עם נוף פתוח, 2 חניות פרטיות.\nכניסה גמישה החל מינואר\nלפרטים נוספים: יקיר - 0502750090\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "user tow", "להשכרה דירת 4 חדרים רק ב2,300 ש\"ח.\n\n ברחוב הכ\"ג פינת הלפרין, שכונה ג'.\n\n*96 מ\"ר\n*קומה 3\\3\n*ממוזגת\n\nהדירה מוארת, גדולה ומרווחת להפליא. מתאימה למשפחה, לשותפים או לסטודנטים.\n\nמיקומה הנפלא של הדירה הנ\"ל בעצם מאפשרת הגעה לכל מקום מרכזי וחשוב לתושב העיר, בצעידה של כרבע שעה - מתחם הקניות ביג, קניון הנגב, התחנה המרכזית, בניין המכינה של בן-גוריון, אוניברסיטת בן-גוריון.\n\nריהוט: קומפלט פרט למכונת כביסה\n\nלפרטים: 054-449-0025\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "user user", "קוטג' ברמות להשכרה רק ב2,900 ש\"ח!!!\n\n2 חדרי שינה וסלון\n\nהקוטג' מתאים למשפחות, סטודנטים, שותפים או לזוגות.\nמדובר בשכונה הישנה של רמות.\n\n* כניסה מיידית!!!!!\n* 80 מ\"ר\n* דוד חשמל ושמש\n* גינה ענקית (170 מ\"ר)\n* מזגן בכל חדר\n\nריהוט: ספות 2+3, שידה, שולחן סלון, מיקרוגל, 2 ארונות 4 דלתות, מיטה זוגית+שידות.\n\nלפרטים: 054-449-0025\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dan arieli", "להשכרה קוטג' 3 חדרים בשכונת נחל עשן\n\nממוזגת\nמשופצת\nכניסה מיידית\n65 מ\"ר\nגינה 230 מ\"ר\n\nריהוט: מקרר.\n\nמחיר: רק ב3,500.\n\nטלפון: 052-477-8940\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "dor ashkenazi", "שותף (סטודנט) מחפש 2 שותפים נוספים לדירת 4 חדרים\nשכ״ד לכל חדר - 900 ש״ח\nהדירה היא ברחוב יואל השופט 2 - 5 דקות הליכה מהאוניברסיטה ו5 דקות הליכה ממרכז אורן!\nהדירה משופצת, נעימה ואידיאלית לסטודנטים\nמבחינת ריהוט יש הכל כולל הכל: ספות, שולחן אוכל קטן + 2 כסאות, שולחן סלון, טלוויזיה, מקרר, מיקרוגל, טוסטר אובן, כיריים גז ומכונת כביסה.\nבכל חדר: מזגן, מיטה, מזרון, שולחן כתיבה, כסא וארון\n\nכניסה מיידית אז מוזמנים לפנות אליי בפרטי :)\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "shachar hasson", "להשכרה דירת קרקע 2 חדרים מזגנים בכל הבית רהוט מלא מכונת כביסה מקרר תנור משולב עם גז סלון ועוד... רחוב בר גיורא 7\n חמש דקות מהאוניברסיטה\n1700 בלבד לחודש\nפינוי גמיש 0522623356\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "adi ashkenazi", "נותר חדר אחרון הכולל מקלחת ושרותים צמודים!\nברחוב השלום 20...עם עוד 2 שותפים...\nהדירה ממוקמת מול בת דור ובקרבת בית הספר למשחק ,מרכז מסחרי והמכינה של בן גוריון... הדירה נמצאת בלב העיר וקרובה כמעט להכל כדאי לבוא להתרשם נעשה שיפוץ בסטנדרטיים גבוהים!..החדר כולל טלוויזיה LCD 32 אינצ' מיטה זוגית+מזרן ארון בגדים,מקרר מיני בר ושולחן כתיבה...כניסה מיידית\nמחיר לחדר 1200 שח גמיש למהירי החלטה.\nלפרטים 0524601230 או בפרטי\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ron shoval", "רוצים לחנוך דירה חדשה דנדשה?! אברהם אבינו 14 פינת אלכסנדר ינאי קומה 1. מנעול בכניסה לבניין 80 מטר ל3 שותפים מחיר 1050 לשותף כמובן שגם ריהוט כלול כניסה באמצע חודש 10 תשלום החל מחודש 11. לפרטים 0532731622\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "yuval mendelson", "להשכרה דירת 2.5 ח\"ד\n\nשכונה ד', רח' אלעזר בן יאיר\n\n*משופצת\n*מזגן בכל חדר\n*קומה 3\\1\n\nריהוט: מקרר, ארון 3 דלתות.\n\nכניסה מיידית\n\nמחיר: 2,000 ש\"ח.\n\nלפרטים: 054-449-0025\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "arkadi dochin", "להשכרה יחידת דיור 3 חד' כולל מים וארנונה ב-2,100 ש\"ח\n\nשכונה ג', רח' קלישר 54\nמרחק הליכה קצר לאוניברסיטת בן גוריון\n\n*משופצת\n*מזגן בכל חדר (3 מזגנים)\n*קומה 3\\3\n*יש תשתית אינטרנט של חברת Unlimited!!!\n\nריהוט: עפ\"י דרישה.\n\nכניסה מיידית.\n\nלפרטים: 054-449-0025\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ronen bobo", "נותרו שני חדרים אחרונים !!\nברחוב השלום 29\nהדירה הינה דירת סוייטות מרווחת ומאובזרת(כל חדר מקלחת ושירותים) המיועדת ל3 שותפים\nשני חדרים שנותרו חדר רגיל (1150) וחדר ענק הכולל סלון (1300 ש\"ח לחודש כבר )\nבכל חדר שולחן לימוד+כסא,ארון, מיטה זוגית+מזרן וטלוויזית LCD.\nקיים מרחב משותף(מטבח סלון ופינת אוכל) הכולל סלון,שולחן סלוני,מקרר,טוסטר,מיקרוגל טלוויזיה ומכונת כביסה.\nהדירה בת כ90 מ\"ר בקומה ג' וממוקמת ליד בת דור ,בסמוך לבית הספר למשחק והקמפוס האקדמי של בן גוריון ובמרחק הליכה ממרכז מסחרי בו ניתן למצוא הכל.\nמיקום מרכזי ביותר ונגיש,בלוק וכניסה סטודנטיאלית וצעירה.\nלפרטים נוספים ותיאום 0524601230\nתינתן הנחה לבאים כקבוצה ולמהירי החלטה\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "sara aharon", "**עדין רלוונטי! - ללא תיווך**\nהתפנתה דירה משופצת מוארת ומדהימה!\nמיקום מעולה - וינגייט שקטה ליד סורוקה והאוניברסיטה\n1000 לכל שותף\nירקן וסופר מעבר לכביש\nשלושה חדרי שינה שווים ומרווחים, בכל אחד ארון, מיטה, שולחן, מזגן וחלון\nמרחב משותף רחב ונעים, מטבח מאובזר כולל מקרר, פינת אוכל מרווחת\nשירותים ומקלחת נפרדים\nמכונת כביסה\nבעל דירה נוח!\nבר 0584050960\nיכולים להתקשר גם אלי-\nשיר 0506966516\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "margalit zhanani", "להשכרה בדרך מצדה\n₪2,700\n\nכתובת :דרך מצדה 95, קומה 2\n75 מטר נטו.\nמקום שקט ובטוח,יש שערים עם מפתח בכניסה לבניין\nדירת ארבעה חדרים-שלושה חדרי שינה, סלון מרווח ומואר,מטבח וחדר שירות.\nעברה שיפוץ כולל לפני שנה וחצי.\nכניסה מיידית\nמזגן בסלון+בשני חדרי שינה.\nהדירה מושכרת עם תנור משולב כיריים+מקרר חדשים.\nהדירה לא מרוהטת והמחיר לא כולל חשבונות.\nיש וועד בית.\n052-6035054 גיל.\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "ben osor", "להשכרה במיתר יחידת דיור בשכונת רבין.\n70 מ\"ר + חצר פרטית + מחסן ומזווה חיצוני.\nנמצאת במקום מרכזי, קרובה לבתי הספר ולמרכז המסחרי של הישוב.\nשני חדרי שינה, מטבח, סלון ושני חדרי שירותים.\nיחידה יפה ומושקעת, בית אבן וגינה גדולה, יפה ומטופחת.\n\nמחיר 2700 ₪\nכדאי לראות.\n\nלפרטים -\nמאיר - 0525816460\nכרמלית - 0525816440\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "rivka tamir", "***להשכרה ברחוב דונקלבלום 1 ב-ו' החדשה***\nדירת 4 חדרים משופצת מהיסוד!!\n-חדר הורים עם שרותים ומקלחת\n-בניין מתוחזק ברמה יוצאת דופן.\n-חניה+מחסן\n-ריהוט: פינת אוכל, 2 מיטות יחיד, 2 ארונות עץ מלא, ארון הזזה עם טריקה שקטה, 2 שידות עץ מלא, כריים, תנור, שולחן סלון, מזנון.\nכניסה: 14/11\nמחיר: 3400\nטלפון לפרטים: 0542054048 יעקב\n" );
//        serviceConnector.getBridge().newPostFromAdmin( "rivka tamir", "***להשכרה ברחוב דונקלבלום 1 ב-ו' החדשה***\nדירת 4 חדרים משופצת מהיסוד!!\n-חדר הורים עם שרותים ומקלחת\n-בניין מתוחזק ברמה יוצאת דופן.\n-חניה+מחסן\n-ריהוט: פינת אוכל, 2 מיטות יחיד, 2 ארונות עץ מלא, ארון הזזה עם טריקה שקטה, 2 שידות עץ מלא, כריים, תנור, שולחן סלון, מזנון.\nכניסה: 14/11\nמחיר: 3400\nטלפון לפרטים: 0542054048 יעקב\n" );
//        ///////////////
//        serviceConnector.getBridge().newPostFromAdmin("עופר","אחלה דירה שבעולם לשלושה שותפים.\n" +
//                "\n" +
//                "ענקית ! 127 מ\"ר. מטבח גדול, סלון גדול, חדרים גדולים.\n" +
//                "ממ\"ד (חשוב :(), 2 שירותים ומקלחות. \n" +
//                "בניין מצויין - נעים כל השנה, אין רעש מהשכנים ולא תצליחו להרעיש להם, מעליות וחנייה.\n" +
//                "יש סלון, פינת אוכל, מוצרי חשמל במטבח, כביסה, ארונות בחדרים, מיטה, וכו'... ריהוט נוסף יוכנס לפי הצורך.\n" +
//                "המרפסת חלל !!!!! נוף לפארק ולמדבר מקומה שמינית, אין דברים כאלה !\n" +
//                "מותר בעלי חיים, מותר לעשן, מותר מה שבא לכם.\n" +
//                "3300 שקל לכל הדירה, כניסה ב1 לספטמבר (גמיש), יהודה הלוי 50, כ12 דקות לאוניברסיטה, כמה דקות הליכה ממצדה וכל מיני פאבים. \n" +
//                "עופר - 0548081072, בוואטסאפ (הכי טוב)");
//        serviceConnector.getBridge().newPostFromAdmin("bts","דירת ארבעה חדרים מתפנה כולה במיקום הכי שווה בב\"ש!! רחוב המלך שלמה 13ב' קומה 3\n" +
//                "הדירה במרחק דקה מהמנגה, 5 דק משער סורוקה, ויש שתי חנויות מכולת במרחק של 5 דק\n" +
//                "כל הטוב הזה ב-1200 (אין וועד בית)\n" +
//                "כניסה ב-1.8 המשך חוזה מול בעל הדירה ב-1.9\n" +
//                "פרטים:\n" +
//                "0507274005 חן");
//        serviceConnector.getBridge().newPostFromAdmin("ג'נקוק","**מתפנה דירת 4 חדרים מפנקת ומושלמות ל-3 שותפים או משפחה**\n" +
//                "\n" +
//                "גודל: 95 מ', 3 חדרי שינה וסלון, משופצת מרוהטת בכל טוב, עם מרפסת שירות באחד החדרים.\n" +
//                "\n" +
//                "ריהוט: מקרר, תנור+גז, שולחן אוכל, מזגן בסלון+ מזגנים חדשים בכל חדר, מערכת סלון הכוללת ספה פינתית+שני מזנונים+שולחן סלון. בכל חדר יש מיטה זוגית+מזרן וארון בגדים. בנוסף קיים שולחן ספרייה ושידה גדולה עם מראה+ 2 שידות קטנות.\n" +
//                "\n" +
//                "מיקום: ביאליק 129 קומה שנייה דירה 5, שכונה א'. 5 דק' הליכה ממכלת סמי שמעון, חנייה בשפע, אזור סופר שקט!! סופר שפתוח 24/7 קרוב מאוד!!\n" +
//                "\n" +
//                "שכירות: 3450 ש\"ח לחודש. חשבונות ארנונה, חשמל ומים בנפרד.\n" +
//                "\n" +
//                "הדירה מתפנה ב1.9.18 לטווח ארוך.\n" +
//                "\n" +
//                "לתיאום ביקור בטלפון/ ווטסאפ\n" +
//                "0505754345 - אורנה (בעלת הדירה).");
//        serviceConnector.getBridge().newPostFromAdmin("קים טהיונג","דירה להשכיר - אוסבלדו ארניה 20, דירת 2 חדרים מרווחת מאוד, משופצת ומוארת. מזגנים כמובן, וריהוט מלא. כניסה ב 1.9, אפשר גם לפני.\n" +
//                "2,350 ש\"ח.\n" +
//                "052-5565701.");
//        serviceConnector.getBridge().newPostFromAdmin("פארק ג'ימין","\n" +
//                "קרובה מאוד לאוניברסיטה, מאחורי רגר, דירת 4 חדרים משופצת בסמטת הבשור 13(ליד סוסו הכהן)\n" +
//                "הדירה בקומה 3 מתוך 4. 76 מ\"ר מתאימה ל-3 שותפים\n" +
//                "ממוזגת ומרוהטת לגמרי כולל תנור גז + כיריים ומכונת כביסה\n" +
//                "כניסה באוקטובר\n" +
//                "שכ\"ד: 3300 לדירה\n" +
//                "לידור 0526380716\n" +
//                "תומר: 0503296208\n" +
//                "דור: 0546415303");
//        serviceConnector.getBridge().newPostFromAdmin("ג'ימיני","\n" +
//                "דירה מקסימה לשתי שותפות או לזוג :)\n" +
//                "עוזבים את הבית שלנו אחרי 3 שנים, דירה מקסימה, מרוהטת כמעט באופן מלא, משופצת יחסית ובמיקום מעולה!\n" +
//                "הדירה בשכונה ו' הישנה, רינגלבלום 36, קומת קרקע, 2 חדרים וסלון, חצר קדמית ואחורית, מול כל המסעדות, תחנת האוטובוס, שנייה מהאוניברסיטה, ובאזור שקט ונעים.\n" +
//                "זוהי דירה מחולקת אבל עם פרטיות, ללא בעלי חיים.\n" +
//                "הדירה מטופלת טוב ובעל הדירה מקסים ומגיע לכל מה שצריך\n" +
//                "כניסה ב- 1.8\n" +
//                "עד אוקטובר 2400 ואחרי 2500");
//        serviceConnector.getBridge().newPostFromAdmin("ולדה","דירת 4 חדרים 100 מטר רגר104\n" +
//                "דקה הליכה משער 90.\n" +
//                "הדירה מתאימה ל3 שותפים,מרוהטת במלואה-להביא תיק ולהיכנס\uD83D\uDE1C\n" +
//                "בכל חדר יש מיטה,ארון,שולחן עבודה,מזגן חדש,\n" +
//                "בבית יש פינת אוכל,סלון,מזגן,מקרר,מכונת כביסה תנור עם כיריים וכו...לפרטים נוספים בטלפון בלבד..\n" +
//                "חיים -0529202034\n" +
//                "\n");
//        serviceConnector.getBridge().newPostFromAdmin("אושר לביא","\n" +
//                "דירה ריקה לשלושה שותפים!!!-דירת High Standard - בת 4 חדרים (90 מ\"ר) ממוקמת על פינת מרכז אורן,רגר 183.בדירה הייתה גרה משפחה כך שדאגו לשיפוץ מהיסוד . שכר הדירה הוא 3450 ש״ח, 1150 ש\"ח לכל חדר.נא לתאם ב-SMS עם נפתלי 0549444338 . כניסה 1/10/18.\n");
//        serviceConnector.getBridge().newPostFromAdmin("תומר צרפתי","מהר מהר לפני שיגמר..\n" +
//                "דירת שלושה שותפים שווה לאללה!\n" +
//                "שדרות רגר 150, פינת רינגנבלום שכונה ו' הישנה, 9 דק הליכה משער 90 ו8 דק הליכה משער רגר, דקה ממרכז אורן ו4 דק מהבארים של רינגנבלום (ומהסנדוויץ).\n" +
//                "דירת 4 חדרים יפיפיה עם סלון גדול ומפנק עם יציאה למרפסת גדולה עם בר עץ, מטבח ענק ומאובזר. שירותים ומקלחת בנפרד! חדרים גדולים ומרווחים (אחד במיוחד) ומזגן בכל חדר. \n" +
//                "זהו. 3000 שח לכל הדירה. קומה 3.\n" +
//                "כניסה ב1.9 \n" +
//                "לפרטים לשלוח הודעה בפרטי.");
//        serviceConnector.getBridge().newPostFromAdmin("אביב צרפתי","\n" +
//                "אחרי 3 שנים עוזבים את הדירה המדהימה שלנו!\n" +
//                "דירת 3 חדרים ענקית (74 מ\"ר!) בדרך מצדה 71, כ20-25 דק' הליכה מהאוניברסיטה. דירה עורפית, ברחוב מצדה המואר והנעים, קומה 4 מתוך 4 (הגג עבר זיפות לפני שנתיים).\n" +
//                "בדירה מטבח ענק, אמבטיה כיפית (לא מקלחון), 2 חדרי שינה (אחד גדול ואחד עוד יותר גדול, כפי שניתן לראות בתמונות), שירותים (בנפרד מהאמבטיה), מרפסת שירות ומרפסת קטנה בסלון.\n" +
//                "הדירה מרוהטת לגמרי וכוללת מכונת כביסה חדשה (נקנתה לפני שנתיים), סלון קומפלט (חוץ מהטלוויזיה), חדרי שינה (כוללים בסיס מיטה, שולחן כתיבה, ארון בגדים גדול ושידה) ומטבח שכולל כיריים גז ומקרר.\n" +
//                "בדירה כרגע יש 2 שותפים שעוזבים אך מצוינת גם לזוג.\n" +
//                "הדירה לא משופצת אך במצב מצוין, עם מקלט בבניין. דקה הליכה מהדירה יש מכולת ו5 דק' הליכה יש ירקן.\n" +
//                "אין וועד בית, יש רק תשלום של 10 ₪ כל חודשיים על החשמל בחדר מדרגות שנאסף על ידי אחת המשפחות בבניין. ארנונה היא 500 ₪ לחודשיים לפני הנחת סטודנט (250 ₪ אחרי הנחה).\n" +
//                "תאריך כניסה: 1.9, ניתן להיכנס החל מה1.8, אין אפשרות להיכנס מאוחר יותר.\n" +
//                "מחיר: 2400 ₪ לחודש, לא כולל חשבונות.\n" +
//                "פנויים להראות את הדירה בעיקר בערבים בתיאום מראש, ניתן לפנות בטלפון או בהודעה.\n" +
//                "נגה – 0509160192, גב - 0524399585");
//        serviceConnector.getBridge().newPostFromAdmin("מנחם בגין","*ברינגלבלום 36, בדיוק מול המסעדות והפאבים של רינגלבלום*, 5 דק' הליכה מהאוניברסיטה.\n" +
//                "\n" +
//                "מתפנה יחידת דיור, 47 מ''ר, קומת קרקע, 2 חדרים, בנוסף לחצר פנימית ענקית מרוצפת (14 מ\"ר), נעימה ומשותפת.\n" +
//                "בחדר יש מזגן ונשאר בסיס מיטה, שולחן -ענק- ומפנק ללימודים וארון גדול ומעולה גם לאחסון, בסלון נשארים ספה, כיסאות, מקרר וארונות האחסון שבתמונה. \n" +
//                "כל השאר יכולים להימכר במחיר מאוד סמלי.\n" +
//                "הכניסה שקטה, נעימה ומוארת. באזור הכי מעולה לגור בו.\n" +
//                "הדירה מתאימה ליחיד ( קצת צפוף, אך גם זוג גר בה 4 שנים =] )\n" +
//                "בעל דירה נהדר ונותן מענה מיידי.\n" +
//                "- ללא מעשנים וללא בע''ח.\n" +
//                "כניסה בחודש אוגוסט - לא גמיש.\n" +
//                "שכר דירה: 1800₪.\n" +
//                "\n" +
//                "לפרטים נוספים: אסף - 054-7792193\n" +
//                "דנה - 054-6436796");
//        serviceConnector.getBridge().newPostFromAdmin("אור סמו","**מראים את הדירה היום בערב**\n" +
//                "\n" +
//                "מחפשים שותפה לדירת 4 חדרים במשחררים 9 פינת שמעוני משופצת ברמה גבוהה!!\n" +
//                "√ 15 דק׳ הליכה מהאוניברסיטה, 5 דק׳ ממכללת סמי שמעון.\n" +
//                "√ הדירה מרוהטת קומפלט - סלון, שולחן סלון, פינת אוכל, מקרר ותנור.\n" +
//                "√ בכל חדר - ארון 3 דלתות, ארון דלת אחת, בסיס מיטה ושולחן כתיבה.\n" +
//                "√ בכל חדר מקלחת ושירותים פרטיים!! \n" +
//                "√ מזגנים בסלון ובכל החדרים. \n" +
//                "√ רשתות בסלון ובחדרים.\n" +
//                "√ מחיר: 1200 ש״ח \n" +
//                "√ ללא תיווך\n" +
//                "√ תאריך כניסה: 15.9\n" +
//                "\n" +
//                "*לתאום: 0509884996 (עידן)*");
//        serviceConnector.getBridge().newPostFromAdmin("מיטל המלכה","מפנה את החדר שלי בדירה הכי קרובה לאוניברסיטה- רגר 105 \uD83D\uDE0A\n" +
//                "בדירה נשארים Nofit Drihem Saar Yazdi והם מחפשים שותפה!\n" +
//                "דירת 4 חדרים, קומה שניה, ממש מול האוניברסיטה.\n" +
//                "הדירה מרוהטת ב100%: כל הריהוט בחדר, סלון, פינת אוכל, טלוויזיה, מכונת כביסה... \n" +
//                "סלון ענק, פינת אוכל ענקית, מטבח ענק. \n" +
//                "כל התענוג הזה ב1050 (אין מחיר כזה על רגר!!)\n" +
//                "* כניסה באוגוסט\n" +
//                "* מסיימת שנה א' ומעלה\n" +
//                "* לא מעשנת\n" +
//                "לפרטים ולתיאום- בפרטי או בטלפון 0523782638");
//        serviceConnector.getBridge().newPostFromAdmin("שרית חדד","**2 חדרים מתפנים בדירת 4 חדרים בשכונה ב'**\uD83D\uDE0E\n" +
//                "הדירה ברח' יעקב כהן 13, בניין חדש עם לובי וחנייה, קודן ומעליות. בדירה מרפסת גדולה+סלון ענק+מטבח מאובזר, 130 מ\"ר!! בחדר אחד נשאר ארון, שולחן ובסיס מיטה ובחדר השני ארון ובסיס מיטה+ אופציה לקנות חלק מהריהוט שנשאר בחדרים.ריהוט חלקי בשאר הדירה, מיזוג מרכזי. הבניין נמצא באיזור הכי אטרקטיבי בב\"ש!!! מול קופיקס, מקס סטוק, שופרסל ומאפיה, רבע שעה הליכה מהאוניברסיטה. ללא בע\"ח.\n" +
//                "1300 ש\"ח לשותף, 250 ש\"ח ועד בית בחודש (מתחלק בין 3 שותפים)\n" +
//                "לפרטים נוספים בפרטי או בטלפון\uD83D\uDE0A\n" +
//                "0525813688\n" +
//                "מראה את הדירה ביום רביעי וחמישי בין השעות 18-20. לתאם מראש.");
//        serviceConnector.getBridge().newPostFromAdmin("מאור אדרי","אני ו Alon Rozanka מחפשים שותפה שתצטרף אלינו לדירה במיקום מושלם - אלכסנדר ינאי 8! מרחק שתי דקות הליכה לשער רגר!\n" +
//                "הדירה מרווחת מאוד, ויש בה מרפסת סגורה קטנה. המטבח יעבור חידוש בקיץ ע\"י בעל הדירה, ואנחנו נשדרג את הסלון עם ספת ר' גדולה ומפנקת!\n" +
//                "החדר שמתפנה מופיע בתמונות, השכ\"ד 1150, תאריך הכניסה הוא 1.10 כאשר ישנה אפשרות לסאבלט את החדר מה 1.09 (לא מותנה בחתימה).\n" +
//                "הסלון והמטבח מרוהטים, בדירה יש רק שירוקלחת אחת, בחדר נשארים מיטה+מזרן, שולחן וארון. \n" +
//                "מראים את הדירה מחר ב 18:00-20:00\n" +
//                "נא לתאם מראש:\n" +
//                "חן - 0546861124\n" +
//                "אלון - 0542545116");
//        serviceConnector.getBridge().newPostFromAdmin("איתי לוי","בשלמה המלך 1. 3 חדרי שינה וסלון. בכל חדר: מיטה, ארון, שולחן כתיבה ומזגן. מכונת כביסה. 2 חדרי שירותים. אמבטיה משופצת. קרובה מאוד לאוניברסיטה. החדרים הפנויים: חדר אחד ב 1150 ש\"ח. חדר נוסף ב 1000 ש\"ח. בן מחפש 2 שותפים/ות . כניסה ב 1/10/2018 . לפרטים: 050-6402718");
//        serviceConnector.getBridge().newPostFromAdmin("עברי לידר","* להשכרה דירת 3 שותפים ברחוב יצחק שיפר 12 בשכונה ו' הישנה **** \n" +
//                "הדירה משופצת, מוארת, מרווחת, ממוזגת ומרוהטת קומפלט, רק להביא בגדים.\n" +
//                "נמצאת במרחק 10 דקות הליכה לשער 90, 5 דקות לאיזורי הבילוי הסטודנטיאלים ברחוב רינגלבלום.\n" +
//                "בדירה שירותים ומקלחת בנפרד, מכונת כביסה, שולחן אוכל וכסאות, ספה, טלוויזיה, דוד שמש+חשמל, תנור, כיריים, טוסטר, מקרר, ועוד. בכל החדרים מיטה זוגית, ארון ושולחן+כסא.\n" +
//                "מחיר חדרים רגילים - 975 ש\"ח\n" +
//                "מחיר חדר גדול עם טלויזיה - 1050 ש\"ח\n" +
//                "כניסה 1/9, אפשרי גם 1/8 לחדר הגדול.\n" +
//                "\n" +
//                "מראים בתיאום מראש:\n" +
//                "יום רביעי 20/6 בשעות 17:00-19:00\n" +
//                "\n" +
//                "לפרטים: גיא 0543154942 או בפייס\n" +
//                "לתיאום: איתן: 0545310900, יובל 0526117153, זהרי 0556648057");
//        serviceConnector.getBridge().newPostFromAdmin("מוקי","סטודנט/ית? מחפשים דירה סטודיו?\n" +
//                "ברחוב אביה השופט 1 בב\"ש, באזור סטודנטיאלי ושקט, במרחק הליכה מהאוניברסיטה, אתם מוזמנים לראות את הדירות הזוגיות שלנו.\n" +
//                "****\n" +
//                "כל דירה מאובזרת במיטה + ארון בגדים+שולחן+כיסא+שידת טלוויזיה מקרר+מיקרוגל+כיריים חשמליות+מזגן+טלוויזיה.\n" +
//                "בבניין ישנו חדר כושר+חדר כביסה לשימוש דיירי הבניין בלבד.\n" +
//                "בנוסף, תוכלו למצוא בכל קומה ממ\"ד.\n" +
//                "****\n" +
//                "המחיר?\n" +
//                "רקקקקק 1250 ש\"ח!!!\n" +
//                "****\n" +
//                "20 הראשונים יקבלו אינטרנט+כבלים חינם לשנה!!!\n" +
//                "\n" +
//                "לפרטים התקשרו ☎️ 0546261689 או שלחו הודעה פרטית \uD83D\uDCE9 !");
//        serviceConnector.getBridge().newPostFromAdmin("זוהר ארגוב","\n" +
//                "היי \uD83D\uDE0A, אני מחפשת שותפה / שתי שותפות חדשות (שותפה אחת מתחתנת והשנייה עוברת לגור עם החבר \uD83D\uDE0A) בדירתנו המהממת- פרקט, קיר נצנצים וכל מה שבחורה צריכה בחיים.\n" +
//                "על שער 90 מיקום מעולה -רחוב שמחה אסף 41 (פחות מדקה לאוניברסיטה) ושכר דירה במחיר הוגן ביותר של 950 שח לחודש. דירת 4 חדרים (3 חדרי שינה וסלון). \n" +
//                "בשני החדרים שמתפנים נשארים מיטה, בסיס מיטה, שולחן, מזגן, כיסא וארון.\n" +
//                "רק להביא בגדים(;\n" +
//                "כניסה ב1.10 ואפשר גם לפני (מאוגוסט). \n" +
//                "חשוב ללא בעלי חיים ושלא תעשן(; \n" +
//                "0524764162 – ספיר");
//        serviceConnector.getBridge().newPostFromAdmin("אברהם טל","\n" +
//                "אני וNoam Galor מחפשים שותפה נקיה, לא מעשנת ובראש טוב לדירה מדהימה !\n" +
//                "הדירה נמצאת במיקום מצוין , ברחוב המבוקש טשרניחובסקי (14) פינת מצדה , קרוב לפאבים, לסופר ולירקן בשכונה ב' בבאר שבע.\n" +
//                "דירת 4 חדרים ענקית (90 מ''ר), מרווחת מאוד, מוארת, מרוהטת וממוזגת(מזגן בכל חדר + סלון).\n" +
//                "בניין נקי ומטופח.\n" +
//                "החדר שמתפנה הוא החדר הגדול בדירה, כולל מזגן וארון.\n" +
//                "\n" +
//                "שכ''ד - 1150 לחודש.\n" +
//                "\n" +
//                "לפרטים נוספים (עדיף בוואטסאפ) - \n" +
//                "נועם - 0544263610\n" +
//                "נעם - 0542114172");
//        serviceConnector.getBridge().newPostFromAdmin("מושיק עפיה","להשכרה!!!!! קרקע ללא חצר 2 חדרים. משעול סוכות/ פינת קדש מרחק 9 דק' הליכה לבן גוריון . \n" +
//                "מתאימה לזוג/ יחיד. 1900 ש\"ח לא כולל חשבונות. חדשה לגמריי סטנדרט גבוה \uD83D\uDE09 . עם ריהוט ומוצרי חשמל , מזגן בכל חדר. חדר השינה הוא ממ\"ד מרווח . דירה מקסימה.\n" +
//                "לפרטים ותיאום לראות וכו' וכו' וכו' רק בפון .\n" +
//                "0506966325 שי- לא בשבת.\n" +
//                "דירה פגזז מיקום פגזזז.\n" +
//                "כניסה 1.9.");
//        serviceConnector.getBridge().newPostFromAdmin("חיים משה","קרובה מאוד לאוניברסיטה, דירת 4 חדרים משופצת בסמטת הבשור 13(ליד סוסו הכהן)\n" +
//                "הדירה בקומה 3 מתוך 4. 76 מ\"ר מתאימה ל-3 שותפים\n" +
//                "ממוזגת ומרוהטת לגמרי כולל תנור גז + כיריים ומכונת כביסה\n" +
//                "כניסה באוקטובר\n" +
//                "שכ\"ד: 3300\n" +
//                "לידור 0526380716\n" +
//                "תומר: 0503296208\n" +
//                "דור: 0546415303");
//        serviceConnector.getBridge().newPostFromAdmin("חיים כהן","\n" +
//                "דירה בת 4 חדרים מחפשים שוטף שוטפה שלישי/ת\n" +
//                "\n" +
//                "מאויישת ע\"י שני סטודנטים ומחפשים שותפ/ה שלישי/ת לא מעשנ/ת. בחדר יש בסיס מיטה ומזרן, ארון ושולחן סטודנט. כמו כן, מותקנת דלת דקורטיבית למניעת רעש. בסלון יש פינת ישיבה ופינת אוכל.\n" +
//                "הדירה מאובזרת לחלוטין, כוללת מכונת כביסה ותנור מובנה חדשים מקרר ומיקרוגל. כל הדירה ממוזגת. הדירה נמצאת ברח' סימטת קדש 32 קומה 3 בבאר שבע, במרחק 400 מטר (ארבע דקות הליכה) מהאוניברסיטה- שער רגר.\n" +
//                "מחיר השכירות 1000 ש\"ח, לחדר.\n" +
//                "הכניסה בתאריך 01/09/18. מראים את הדירה בתיאום טלפוני מראש.\n" +
//                "\n" +
//                "טל' ליצירת קשר 052-3900559 יהודית.");
//        serviceConnector.getBridge().newPostFromAdmin("אדם לוין","דרוש/ה שותפ/ה לחדר בדירה מדהימה ברחוב רגר 134 (250 מ' מהאוניברסיטה) ששופצה לפי תוכנית אדריכלית למי שרוצה לגור ברמה גבוהה ברגר קרוב לאוניברסיטה. \n" +
//                "הדירה והחדר מרוהטים קומלפט ומאובזרים באופן מלא, חדר הרחצה והשירותים משותפים רק ל-2 חדרים. \n" +
//                "בחדר - מיטה זוגית, מזרון, שולחן מדפים תלויים ומזגן- רק להביא כיסא ומצעים.\n" +
//                "בדירה- יש עוד מבואה, סלון מטבח וחדרון למכונת הכביסה. המשותפים לעוד 3 שותפים. הדירה מאובזרת באופן מלא, יש סלון 2+3, שולחן סלון, מזגן בסלון, פינת אוכל מקרר מכונת כביסה, מיקורגל, קומקום חשמלי, כיריים גז ותנור חשמל ומסך 32' lcd, בקיצור מה שרואים בתמונה זה מה שמקבלים.\n" +
//                "המחיר -1,200 ש\"ח\n" +
//                "כניסה אפשרי גם ב-1.10 \n" +
//                "טלפון:050-5664848 יוסי");
//        serviceConnector.getBridge().newPostFromAdmin("מרון פייב","דרוש/ה שותפ/ה לסוויטה בדירה מדהימה ברחוב רגר 134(250 מ' מהאוניברסיטה) ששופצה לפי תוכנית אדריכלית למי שרוצה לגור ברמה גבוהה ברגר קרוב לאוניברסיטה. \n" +
//                "הסוויטה כוללת חדר+חדר רחצה ושירותים מפואר צמוד פרטי, מיטה זוגית, מזרון, ארון, שולחן ומזגן- רק להביא כיסא ומצעים.\n" +
//                "ישנם עוד מבואה, סלון מטבח וחדרון למכונת כביסה המשותפים לעוד 3 שותפים.\n" +
//                "הדירה מאובזרת באופן מלא יש סלון 2+3, שולחן סלון, מזגן בסלון, פינת אוכל, מקרר מכונת כביסה, מיקרוגל קומקום חשמלי ומסך lcd32' בקיצור מה שרואים בתמונות זה מה שמקבלים\n" +
//                "המחיר -1,500 ש\"ח\n" +
//                "כניסה 1.9 \n" +
//                "טלפון:050-5664848 יוסי");
//        serviceConnector.getBridge().newPostFromAdmin("עדן הראל","");
//        serviceConnector.getBridge().newPostFromAdmin("עודד מנשה","");
//        serviceConnector.getBridge().newPostFromAdmin("טל מוסרי","");
//        serviceConnector.getBridge().newPostFromAdmin("דון לני גבאי","");
//        serviceConnector.getBridge().newPostFromAdmin("עידו לב","");
//        serviceConnector.getBridge().newPostFromAdmin("טל מוסרי","");
//        serviceConnector.getBridge().newPostFromAdmin("עדי הימלבלוי","");
//        serviceConnector.getBridge().newPostFromAdmin("ידידיה ויטל","\n" +
//                "דירה ע-נ-ק-ית! 130 מ\"ר!!! מציאה!!! ,ממוקמת ברחוב מבצע נחשון 66, אזור שקט ובטוח (מצטלב עם מצדה), 5 חדרים, 3 מרפסות, 3 שירותים,במתחם הבניין בריכת שחייה חצי אולימפית מקורה,חדר כושר וסאונה פרטיים לדירי הבניין בלבד! \n" +
//                "הדירה כוללת: מזגנים חדשים, מטבח,מכונת כביסה,מקרר,תנור,כריים,מיקרוגל, ספה, שולחן טלויזייה, ארון, מיטה, שולחן לימודים.\n" +
//                "מתאימה לסטודנטים וגם למשפחות.\n" +
//                "15 דק' הליכה מהאוניברסיטה או 5 דק' באופנים!\n" +
//                "ללא תיווך! וכל זה ב- 1,250 ש\"ח לשותף ו 1000 לחדר הקטן. או 4600 ש\"ח עבור כל הדירה.\n" +
//                "החדר הקטן מתפנה החל מ 1.10 וגם אחד החדרים הגדולים.\n" +
//                "2 החדרים האחרים מתפנים ב1.8.\n" +
//                "כלומר, כל הדירה מתפנה ב1.10.\n" +
//                "לפרטים: 050-5600249 צבי");
//        serviceConnector.getBridge().newPostFromAdmin("רן דנקר","\n" +
//                "דירה מקסימה לשתי שותפות או לזוג :)\n" +
//                "עוזבים את הבית שלנו אחרי 3 שנים, דירה מקסימה, מרוהטת כמעט באופן מלא, משופצת יחסית ובמיקום מעולה!\n" +
//                "הדירה בשכונה ו' הישנה, רינגלבלום 36, קומת קרקע, 2 חדרים וסלון, חצר קדמית ואחורית, מול כל המסעדות, תחנת האוטובוס, שנייה מהאוניברסיטה, ובאזור שקט ונעים.\n" +
//                "זוהי דירה מחולקת אבל עם פרטיות, ללא בעלי חיים.\n" +
//                "הדירה מטופלת טוב ובעל הדירה מקסים ומגיע לכל מה שצריך\n" +
//                "כניסה ב- 1.8\n" +
//                "עד אוקטובר 2400 ואחרי 2500");
//        serviceConnector.getBridge().newPostFromAdmin("אליאנה תדהר","דירה נהדרת לשלישיה או ל 3 בודדים, 150 רגר. 2 חדרים בינוניים ב 900 ש\"ח כ\"א, וחדר שינה ענקית ב 1000 ש\"ח. דירה מסודרת ומרוהטת, עם מזגן בכל חדר למרות 3 כיווני אוויר. סלון, פינת אוכל, מטבח מאובזר, מרפסת קטנה, הכל. מקום מעולה, מול מרכז אורן, 10 דק. משער 90. לא פונה לרגר, דירה שקטה. מציאה. מתפנה ב 1.9. כדאי לראות, אפשר לתאם בהודעה לדייר נתנאל, 054-744-0819. \n" +
//                "כדאי לשמוע עוד פרטים או לשאול שאלות, אפשר להתקשר לנטע 0507579231 או עודד 0507579132 או שושנה 0507579223.");
//        serviceConnector.getBridge().newPostFromAdmin("אליענה בקייר","רחוב אברהם אבינו 2 ( כיכר האבות) דירת קרקע 2 חדרים עם חצר גדולה, מתאימה לזוג או יחיד. \n" +
//                "2,300₪ כולל ארנונה.\n" +
//                "כניסה 1/8. \n" +
//                "בדירה יש ספה, בסיס+ מזרן, ארון בגדים, מקרר כיריים חשמליות ומכונת כביסה. לפרטים נוספים שלחו הודעות לפרטי.");
//        serviceConnector.getBridge().newPostFromAdmin("מייקל לואיס","דירת 2 חדרים קומת קרקע ~60 מ\"ר מאוד מרווחת.\n" +
//                "רחוב יצחק שיפר 17\n" +
//                "רחוב קטן ללא מוצא ושקט מאוד.\n" +
//                "\n" +
//                "צמוד לרינגלבלום ורק 7 דק' הליכה לשער רגר או שער 90.\n" +
//                "\n" +
//                "מרוהטת ומסודרת, לאחר שיפוץ (הוחלפה צנרת וחשמל).\n" +
//                "מאוד מוארת ומרווחת, איניטימית מאוד.\n" +
//                "\n" +
//                "מתאימה לזוגות או לבודדים.\n" +
//                "התמונות צולמו ממש לאחר השיפוץ עוד לפני הריהוט.\n" +
//                "\n" +
//                "יש מקרר\n" +
//                "תנור וכיריים\n" +
//                "ספה\n" +
//                "ארון\n" +
//                "מיטה זוגית\n" +
//                "מזגנים\n" +
//                "וכיו\"ב.\n" +
//                "\n" +
//                "שכירות 2200 ש\"ח\n" +
//                "דירת 2 חדרים קומת קרקע ~60 מ\"ר ת מילואים!!! שווה \n" +
//                "אחלה בעל בית זמין לכל בעיה.\n" +
//                "\n" +
//                "לתאום:\n" +
//                "052-2206874");
//        serviceConnector.getBridge().newPostFromAdmin("יהורם גאון","\n" +
//                "יום רביעי 20/6 21:00 -20:00. בית פתוח. אפשר להגיע חופשי. דירת 4 חדרים. מתאימה ל-3 שותפים או משפחה. במרחק 2 דקות משער 90 ודקה מהמסעדות ובתי הקפה ברינגלבלום!\n" +
//                "בנימין מטודלה 12. קומה ראשונה (לא קרקע) דירה בצד ימין. כניסה גמישה מאוד. 1050 ש\"ח לשותף גם אם אין לכם שותפים.\n" +
//                "הדירה מרוהטת לחלוטין וכוללת:\n" +
//                "* מטבח הכולל תנור, גז, מקרר\n" +
//                "* פינת אוכל + כסאות\n" +
//                "* סלון הכולל ספות, טלויזיה, שולחן ומזגן\n" +
//                "* מכונת כביסה\n" +
//                "* בכל חדר ארון בגדים גדול! מיטה זוגית, מזרן, שולחן כתיבה, כסא ומזגן\n" +
//                "לשאלות הרגישו חופשי להתקשר 052-3725746");
//        serviceConnector.getBridge().newPostFromAdmin("ציפי שביט","מפנה את החדר שלי בדירה הכי קרובה לאוניברסיטה- רגר 105 \uD83D\uDE0A\n" +
//                "בדירה נשארים Nofit Drihem Saar Yazdi והם מחפשים שותפה!\n" +
//                "דירת 4 חדרים, קומה שניה, ממש מול האוניברסיטה.\n" +
//                "הדירה מרוהטת ב100%: כל הריהוט בחדר, סלון, פינת אוכל, טלוויזיה, מכונת כביסה... \n" +
//                "סלון ענק, פינת אוכל ענקית, מטבח ענק. \n" +
//                "כל התענוג הזה ב1050 (אין מחיר כזה על רגר!!)\n" +
//                "* כניסה באוגוסט\n" +
//                "* מסיימת שנה א' ומעלה\n" +
//                "* לא מעשנת\n" +
//                "לפרטים ולתיאום- בפרטי או בטלפון 0523782638");
//        serviceConnector.getBridge().newPostFromAdmin("תובל שפיר","\n" +
//                "שני חדרים מתפנים בדירת 4 חדרים ברגר 150. 1100 לחדר\n" +
//                "\n" +
//                "בדירה מכונת כביסה, סלון ומרפסת מפנקת, במיקום הכי שווה בב\"ש!!!\n" +
//                "בכל חדרי השינה ובסלון יש מזגנים חדשים, החדרים מאובזרים בצורה מלאה.\n" +
//                "הדירה על רחוב גדול ומרכזי צמודה למרכז אורן(מגה, מאפיה, ירקן, בנק ומזון מהיר). כל חדרי השינה עורפיים.\n" +
//                "במיקום הכי טוב בעיר 7 דקות הליכה לאוניברסיטה ו3 דקות הליכה לאזור המסעדות של רינגבלום.\n" +
//                "חדר אחד מתפנה ב1.8 וחדר שני מתפנה ב1.9\n" +
//                "\n" +
//                "אין אפשרות להכניס בע\"ח לדירה. מעשנים במרפסת בלבד.\n" +
//                "הדירה מרווחת (78 מ\"ר) בקומה שלישית. \n" +
//                "פרטים נוספים בהודעה פרטית אלי(בעל הדירה)\n" +
//                "מראים את הדירה ב20.6 וב21.6 בשעות 18:30 עד 20:30 בתיאום מראש עם נועם או שיר.\n" +
//                "נועם (עוזב) - 050-9645555\n" +
//                "שיר (נשארת) - 052-3680135");
//        serviceConnector.getBridge().newPostFromAdmin("גל גדות","\n" +
//                "*דירת 3 חדרים גדולה ומשופצת להשכרה!*\n" +
//                "בשכונה ד' רבי עקיבא 78, עשר דקות הליכה מהאוניברסיטה.\n" +
//                "78 מ\"ר עם חדרים גדולים, מטבח נפרד, סלון ופינת אוכל נפרדת מהמטבח. ריצוף חדש, חלונות חדשים וריהוט מלא!\n" +
//                "מיקום שקט שיש בו תמיד חנייה, הדירה מתאימה לשני שותפים או לזוג.\n" +
//                "2400 ש\"ח שכירות, כניסה גמישה החל מאיזור יולי-אוגוסט.\n" +
//                "לפרטים נוספים: 0524653543-סער.");
//        serviceConnector.getBridge().newPostFromAdmin("סלינה גומז","\n" +
//                "היי חבר׳ה,\n" +
//                "מתפנה אחת הדירות השוות באזור, דירת 4 חדרים יפייפיה ומרווחת ברחוב יטבתה 6, 8 דקות מהאוניברסיטה.\n" +
//                "עברה שיפוץ מלא, מרוהטת- מקרר, תנור, כיריים חשמליות, מיקרוגל, פינת אוכל, ספות, מסך גדול בסלון. ובכל חדר: מיטה + מזרן, שולחן+ כסא ומזגנים.\n" +
//                "גם הבניין עבר שיפוץ מלא בקיץ האחרון, כניסה נעימה עם הרבה סטודנטים בבניין.\n" +
//                "1,150 ש״ח לחדר\n" +
//                "לפרטים נוספים : עידן 050-4002312\n" +
//                "\n");
//        serviceConnector.getBridge().newPostFromAdmin("צ'רלי","\n" +
//                "השכרה דירה מושקעת - רח' דרך מצדה 58\n" +
//                "פנויה לשלושה שותפים - משופצת כחדשה. 3 חדרי שינה + סלון ודלפק אוכל , (במחיר 1,100 ₪ לשותף) קומה 3-עם מרפסת. מאובזרת ומרוהטת קומפ': מטבח וסלון + בר, כיסאות, ארונות, מיטות. בדירה מכונת כביסה, מיקרו, תנור וכו'. מזגנים בחדרים ובסלון. מיקום: 15 ד' הליכה מהאוניברסיטה. \n" +
//                "כניסה:1 בספטמבר. לפנות למיכל 052-3435181");
//        serviceConnector.getBridge().newPostFromAdmin("מיקל ג'ורדן","*מתפנה דירת 4 חדרים מפנקת ומושלמת ל-3 שותפים או משפחה**\n" +
//                "\n" +
//                "גודל: 95 מ', 3 חדרי שינה וסלון, משופצת מרוהטת בכל טוב, עם מרפסת שירות באחד החדרים.\n" +
//                "\n" +
//                "ריהוט: מקרר, תנור+גז, שולחן אוכל, מזגן בסלון + מזגנים חדשים בכל חדר, מערכת סלון הכוללת ספה פינתית+שני מזנונים+שולחן סלון. בכל חדר יש מיטה זוגית+מזרן וארון בגדים. בנוסף קיים שולחן ספרייה ושידה גדולה עם מראה+ 2 שידות קטנות.\n" +
//                "\n" +
//                "מיקום: ביאליק 129 קומה שנייה דירה 5, שכונה א'. 5 דק' הליכה ממכלת סמי שמעון, חנייה בשפע, אזור סופר שקט!! סופר שפתוח 24/7 קרוב מאוד!!\n" +
//                "\n" +
//                "שכירות: 3450 ש\"ח לחודש. חשבונות ארנונה, חשמל ומים בנפרד.\n" +
//                "\n" +
//                "הדירה מתפנה ב- 1.9.18 אפשרות לטווח ארוך.\n" +
//                "\n" +
//                "לתיאום ביקור בטלפון / ווטסאפ\n" +
//                "0505754345 - אורנה (בעלת הדירה).");
//        serviceConnector.getBridge().newPostFromAdmin("אביאור מלסה","\n" +
//                "מחפשים שותפה לדירת 4 חדרים במשחררים 9 פינת שמעוני משופצת ברמה גבוהה!!\n" +
//                "√ 15 דק׳ הליכה מהאוניברסיטה, 5 דק׳ ממכללת סמי שמעון.\n" +
//                "√ הדירה מרוהטת קומפלט - סלון, שולחן סלון, פינת אוכל, מקרר ותנור.\n" +
//                "√ בכל חדר - ארון 3 דלתות, ארון דלת אחת, בסיס מיטה ושולחן כתיבה.\n" +
//                "√ בכל חדר מקלחת ושירותים פרטיים!! \n" +
//                "√ מזגנים בסלון ובכל החדרים. \n" +
//                "√ רשתות בסלון ובחדרים.\n" +
//                "√ מחיר: 1200 ש״ח \n" +
//                "√ ללא תיווך\n" +
//                "√ תאריך כניסה: 15.9\n" +
//                "\n" +
//                "*לתאום: 0509884996 (עידן)*\n" +
//                "\n");
//        serviceConnector.getBridge().newPostFromAdmin("נועה קירל","**2 חדרים מתפנים בדירת 4 חדרים בשכונה ב'**\uD83D\uDE0E\n" +
//                "הדירה ברח' יעקב כהן 13, בניין חדש עם לובי וחנייה, קודן ומעליות. בדירה מרפסת גדולה+סלון ענק+מטבח מאובזר.130 מ\"ר!!! בחדר אחד נשאר ארון, שולחן ובסיס מיטה ובחדר השני ארון ובסיס מיטה+ אופציה לקנות חלק מהריהוט שנשאר בחדרים.ריהוט חלקי בשאר הדירה, מיזוג מרכזי. הבניין נמצא באיזור הכי אטרקטיבי בב\"ש!!! מול קופיקס, מקס סטוק, שופרסל ומאפיה, רבע שעה הליכה מהאוניברסיטה. ללא בע\"ח.\n" +
//                "1300 ש\"ח לשותף, 250 ש\"ח ועד בית בחודש (מתחלק בין 3 שותפים)\n" +
//                "לפרטים נוספים בפרטי או בטלפון\uD83D\uDE0A\n" +
//                "0525813688\n" +
//                "מראה את הדירה ביום רביעי וחמישי בין השעות 18-20. לתאם מראש.");
//        serviceConnector.getBridge().newPostFromAdmin("נועה ג'נח","מחפש דירה לשנה הבאה? רוצה לגור סנטימטר מהאוניברסיטה, הלי אופיס וכל הברים? רוצה לגור עם שתי הבנות הכי שוות באזור הדרום? יש לך סוני? \n" +
//                "מקומך איתנו!!\n" +
//                "אני ו Shahar Cohen מחפשות שותף גבר תותחופלצת לשנה הבאה!! \n" +
//                "דירת 4 חדרים משופצת ומרוהטת ברחוב רגר 112 קומה ראשונה. שירותים+שירוקלחת+מטבח שווה+סלון ענקק+דובי.\n" +
//                "שכ״ד 1200 לא כולל, כניסה ב15/8 וחידוש חוזה.\n" +
//                "\n" +
//                "קיצר בואו יהיה כיף ");
//        serviceConnector.getBridge().newPostFromAdmin("נועה אפיק","\n" +
//                "## רח' אליהו הנביא 2, שכונה ד', משופצת ומרוהטת לחלוטין, 2100 ש\"ח כולל ועד בית ##\n" +
//                "\n" +
//                "דירת 2 חד' משופצת ומרוהטת לחלוטין!\n" +
//                "*ללא תיווך*\n" +
//                "\n" +
//                "35 מ\"ר, קומה 3 עם מעלית.\n" +
//                "***כניסה ב1.9***\n" +
//                ">> 2100 ש\"ח כולל ועד בית <<\n" +
//                "לפרטים נוספים ותיאום:\n" +
//                "בני - 052-3943374");
//        serviceConnector.getBridge().newPostFromAdmin("נועה אליאסי","*** דירה מקסימה בשמעוני 3 מתפנה במלואה ***\n" +
//                "\n" +
//                "דירת 4 חדרים, 3 חדרי שינה, סלון, מטבח, שירותים + שירוקלחת.\n" +
//                "הסלון והמטבח מרוהטים מלא: סלון, פינת אוכל, מקרר, גז, טוסטר אובן, שולחן סלון וכו..\n" +
//                "בכל חדר- בסיס מיטה, ארון ושולחן\n" +
//                "וכמובן מזגן בכל חדר ולא מרכזי !\n" +
//                "מיקום אש למי שכבר מכיר את ב\"ש ולמי שלא- 15 דקות מהאוניברסיטה, ממול יש מכולת, ירקן, פלאפל ו3 דק' הליכה מהמקסטוק, שופרסל וסופר קופיקס.\n" +
//                "כניסה – 1.9\n" +
//                "שכ\"ד - 3600\n" +
//                "קומה2/2\n" +
//                "לפרטים נוספים ותיאום מראש:\n" +
//                "נטע- 0546330710");
//        serviceConnector.getBridge().newPostFromAdmin("נועה טייב","** דירה להשכרה - כניסה ב- 1.8.18 **\n" +
//                "\n" +
//                "** בשכונה ג', רחוב קלישר 24, 54 מ\"ר בטאבו, 3 חדרים, קומה ג' ללא מעלית, חניה בשפע **\n" +
//                "\n" +
//                "\uD83C\uDF3A ** 8 דקות מהאוניברסיטה ומהרכבת ** \uD83C\uDF3A\n" +
//                "\n" +
//                "** מתאימה לזוג ו/או שותפים **\n" +
//                "\n" +
//                "** משופצת, נקייה, מוארת וממוזגת, בכל חדר מזגן, חלונות עם רשת (לגירוש הזבובים והאבק) **\n" +
//                "\n" +
//                "\uD83C\uDF3A ** מטבח מאובזר לחלוטין ** מכונת כביסה ** \uD83C\uDF3A\n" +
//                "\n" +
//                "** ריהוט חלקי - הריהוט ישתנה ויתחלף בהתאם לצורך, לכן חלק מהתמונות להמחשה בלבד **\n" +
//                "\n" +
//                "** אפשרי בעלי חיים ** \uD83D\uDC15\uD83D\uDC15\uD83D\uDC15\uD83D\uDC15\n" +
//                "\n" +
//                "** מחיר - 2,250 ש\"ח לחודש ** / ** לא כולל חשבונות **\n" +
//                "\n" +
//                "** טלפון של הדייר העוזב - אורי - 050-7757028 **\n" +
//                "\n" +
//                "** טלפון שלי - 050-6256489 **");
//        serviceConnector.getBridge().newPostFromAdmin("נינט טייב","דירה מדהימה במיקום שקט, שכונה ב' ברחוב שמעוני 6 ב' קומה 3 - 80 מ\"ר 4 חדרים - 10 דקות הליכה מהאוניברסיטה ו 5 דקות הליכה מסורוקה וליד סופר!\n" +
//                "בכל חדר : מזגן, ארון, שולחן ומיטה.\n" +
//                "בדירה נשאר : מקרר, מכונת כביסה, ספות ושולחן בסלון ותנור חדש.\n" +
//                "המחיר לכל הדירה 3300 ש\"ח.\n" +
//                "\n" +
//                "לפרטים נוספים:\n" +
//                "טל חמו : 052-4541908\n" +
//                "יעקב פרנקל : 052-5283115");
//        serviceConnector.getBridge().newPostFromAdmin("אביב אלוש","דירת 4 חדרים יפים (3 שותפים) מתפנת במלואה.\n" +
//                "הדירה במצדה 45 (מעל הפיצה והפסטינה). הדירה משופצת ומוארת.\n" +
//                "כל חדר כולל ריהוט של : מיטה,ארון,שולחן כתיבה ומזגן\n" +
//                "סלון מרוהט ועם מזגן,פינת אוכל, מטבח מרוהט עם תנור,גז ומקרר\n" +
//                "ובנוסף יש גם מכונת כביסה.\n" +
//                "חדרים גדולים, אחד מהחדרים גם כולל מרפסת סגורה.\n" +
//                "1100 לחדר.\n" +
//                "לתיאום טל 0523878573");
//        serviceConnector.getBridge().newPostFromAdmin("ליאור שליין","** סבלט בדירה הכי שווה בבאר שבע ** לחודש אוגוסט ** יחידה אישית עם שירותים ומקלחת פרטיים ** יעקב כהן 5 שכונה ב' ** 1000 ש\"ח (אני משלמת על היחידה 1350) **\n" +
//                "עקב מעבר דירה מוקדם מהצפוי עם החבר, מסבלטת את החדר שלי לחודש\n" +
//                "דירה משופצת וחדשה בבניין חדש (נכנסנו אליה ראשונים לפני שנתיים).\n" +
//                "קומה 3 עם מעלית וקוד בכניסה לבניין.\n" +
//                "הרחוב הוא נעים וליד השופרסל, קופיקס, מאפייה, בית קפה- איזור נוח וביתי.\n" +
//                "גודל הדירה 140 מ\"ר לא כולל המרפסת הענקית! \n" +
//                "יש את כל הריהוט הנדרש בחדר (ובכלל בדירה)- בסיס מיטה, מזרון, ארון בגדים, שולחן וכיסא. החדר גדול ומרווח ויש שירותים ומקלחת צמודים ואישיים. \n" +
//                "נשארים שותפים שהם אחים על מלא והכיף מובטח - ועם זאת הבית והרחוב שקטים ונוחים (מאוד!) לכל מי שמגיע לכאן למכינות וכו' ללמוד.\n" +
//                "לפרטים 0526625065 (עדיף בפלאפון כי חלק מההודעות בפייסבוק מגיעות לספאם)\n" +
//                "- אופציה להארכה תלויה בשותפים שנשארים, נדע באזור אמצע יולי -\n" +
//                "- אשמח לשיתופים -");
//        serviceConnector.getBridge().newPostFromAdmin("ניצן צפלר","דירת 4 חדרים (מתאימה ל-2 או 3 שותפים) באלכסנדר ינאי 30 (שכונה ד'). מיקום מעולה, רק 5 דקות מהאוני'!!!\n" +
//                "בדירה ישנם חדר ענק - 1150 ₪, חדר גדול שכולל מרפסת - 1050 ₪ וחדר קטן - 700 ₪. במידה ואתם זוג שמעוניין להשכיר את כל הדירה יש בהחלט אפשרות להנחה.\n" +
//                "הדירה במצב מצויין, קומה ראשונה מתוך שתיים, מרווחת מאוד ומוארת (78 מ\"ר), בניין מטופח ושכנים נהדרים, כמעט כולם סטודנטים. הדירה מרוהטת לחלוטין, אין צורך להביא כלום: מטבח ענק עם תנור כיריים, מקרר, מיקרוגל, פינת אוכל. כל הדירה ממוזגת, ספות בסלון, וגם מכונת כביסה. בכל החדרים יש בסיס מיטה + מזרן, ארון שולחן כתיבה וכיסא, וכמובן מזגן. הדירה קרובה למרכז גילת שכולל כל דבר שרק צריך (חנויות, מאפיה, בית מרקחת ואפילו טמבוריה)\n" +
//                "ועד בית מצחיק של 30 ש\"ח לחודש (לכל הדירה). אפשר להביא בעלי חיים\n" +
//                "כניסה ב-1.10.18\n" +
//                "לפרטים – כפיר – 0543016310");
//        serviceConnector.getBridge().newPostFromAdmin("טל בוברוב","היי \uD83D\uDE0A, אני מחפשת שותפה / שתי שותפות חדשות (שותפה אחת מתחתנת והשנייה עוברת לגור עם החבר \uD83D\uDE0A) בדירתנו המהממת- פרקט, קיר נצנצים וכל מה שבחורה צריכה בחיים.\n" +
//                "על שער 90 מיקום מעולה -רחוב שמחה אסף 41 (פחות מדקה לאוניברסיטה) ושכר דירה במחיר הוגן ביותר של 950 שח לחודש. דירת 4 חדרים (3 חדרי שינה וסלון). \n" +
//                "בשני החדרים שמתפנים נשארים מיטה, בסיס מיטה, שולחן, מזגן, כיסא וארון.\n" +
//                "רק להביא בגדים(;\n" +
//                "כניסה ב1.10 ואפשר גם לפני (מאוגוסט). \n" +
//                "חשוב ללא בעלי חיים ושלא תעשן(; \n" +
//                "0524764162 – ספיר");
//        serviceConnector.getBridge().newPostFromAdmin("בל אמלין","מחפשות שותף/ה נוסף/ת לדירת 3 שותפים בוינגייט 16, דירה 1. \n" +
//                "קומת קרקע + חצר ענקית, גודל הדירה 105 מ״ר לא כולל החצר. הכניסה נפרדת משאר הבניין. אין ועד בית. \n" +
//                "מלאאאא מקום איחסון! \n" +
//                "7 דק׳ הליכה לרכבת צפון ומשם עוד 5 דק׳ הליכה לאוניברסיטה. \n" +
//                "מעבר לכביש יש מכולת, מאפייה וחנות לכלי עבודה. \n" +
//                "החדר שמתפנה הוא 1100 ש״ח לחודש לא כולל חשבונות. \n" +
//                "נשארות בדירה 2 שותפות (אנוכי, ולשנייה אין פייסבוק) ושתי כלבות מאודדד חמודות ומאולפות (תמונות מצורפות).\n" +
//                "\n" +
//                "כניסה ב1.9 \uD83D\uDE42 \n" +
//                "אפשר לפנות אליי בטלפון או בפרטי - 0526222491 ");
//        serviceConnector.getBridge().newPostFromAdmin("גל לוגסי","אחרי 3 שנים עוזבים את הדירה המדהימה שלנו!\n" +
//                "דירת 3 חדרים ענקית (74 מ\"ר!) בדרך מצדה 71, כ20-25 דק' הליכה מהאוניברסיטה. דירה עורפית, ברחוב מצדה המואר והנעים, קומה 4 מתוך 4 (הגג עבר זיפות לפני שנתיים).\n" +
//                "בדירה מטבח ענק, אמבטיה כיפית (לא מקלחון), 2 חדרי שינה (אחד גדול ואחד עוד יותר גדול, כפי שניתן לראות בתמונות), שירותים (בנפרד מהאמבטיה), מרפסת שירות ומרפסת קטנה בסלון.\n" +
//                "הדירה מרוהטת לגמרי וכוללת מכונת כביסה חדשה (נקנתה לפני שנתיים), סלון קומפלט (חוץ מהטלוויזיה), חדרי שינה (כוללים בסיס מיטה, שולחן כתיבה, ארון בגדים גדול ושידה) ומטבח שכולל כיריים גז ומקרר.\n" +
//                "בדירה כרגע יש 2 שותפים שעוזבים אך מצוינת גם לזוג.\n" +
//                "הדירה לא משופצת אך במצב מצוין, עם מקלט בבניין. דקה הליכה מהדירה יש מכולת ו5 דק' הליכה יש ירקן.\n" +
//                "אין וועד בית, יש רק תשלום של 10 ₪ כל חודשיים על החשמל בחדר מדרגות שנאסף על ידי אחת המשפחות בבניין. ארנונה היא 500 ₪ לחודשיים לפני הנחת סטודנט (250 ₪ אחרי הנחה).\n" +
//                "תאריך כניסה: 1.9, ניתן להיכנס החל מה1.8, אין אפשרות להיכנס מאוחר יותר.\n" +
//                "מחיר: 2400 ₪ לחודש, לא כולל חשבונות.\n" +
//                "פנויים להראות את הדירה בעיקר בערבים בתיאום מראש, ניתן לפנות בטלפון או בהודעה.\n" +
//                "נגה – 0509160192, גב - 0524399585");
//        serviceConnector.getBridge().newPostFromAdmin("עילי בוטנר","\n" +
//                "דירת 4 חדרים, מוארת, מרוהטת ומשופצת ל-3 שותפים ביצחק שיפר 6, קומה 2 (שכונת ו' הישנה), במיקום מעולה וסטודנטיאלי, צמוד לרינגלבלום, לברים ולמקומות הבילוי, במרחק הליכה מהאונ'. אזור שקט ונקי, קרוב לתחבורה ציבורית (לת\"א) ולמרכז מסחרי נוח (מרכז אורן). פירוט הריהוט: מקרר, מ.כביסה, כיריים, מיקרוגל, טוסטר אובן, פינת אוכל, ספה ושולחן סלון, טלוויזיה. בכל חדר מיטה, מזרן, ארון, שולחן וכיסא. מזגן חדש בכל אחד משלושת החדרים והסלון.\n" +
//                "מחיר: 3000 ש\"ח \n" +
//                "ת.כניסה: 1.9\n" +
//                "65 מ\"ר \n" +
//                "טלפון: 054-4251615");
//        serviceConnector.getBridge().newPostFromAdmin("אדר גולד","לזריזים\n" +
//                "מתפנת דירה 3 חדרים + חצר\n" +
//                "כניסה ב 1/09 \n" +
//                "משעול סוכות 20 באר שבע \n" +
//                "דירה משופצת + ריהוט מלא \n" +
//                "מחיר 2700 שח \n" +
//                "ארנונה 180 שח לחודש \n" +
//                "לתאום ביקור שילחו whatsapp ל 053-8285299");
//        serviceConnector.getBridge().newPostFromAdmin("אוהד שרגאי","מתפנה דירת 3 חדרים מרוהטת מקסימה ומוארת ברחוב יוחנן הורקנוס 27.\n" +
//                "במרחק 5 דקות הליכה מהאוניברסיטה, ליד ירקן, מכולת ומאפייה.\n" +
//                "כניסה ב-1.9, מחיר 2100.\n" +
//                "\n" +
//                "בר - 054-2334243\n" +
//                "אורי - 052-8884419\n" +
//                "בעלת הדירה - יסמין - 052-6748558");
//        serviceConnector.getBridge().newPostFromAdmin("תום גפן","\n" +
//                "מתפנה דירת 3 חדרים מרוהטת מקסימה ומוארת באזור סטודנטיאלי ברחוב יוחנן הורקנוס 27.\n" +
//                "במרחק 5 דקות הליכה מהאוניברסיטה, ליד ירקן, מכולת ומאפייה.\n" +
//                "\n" +
//                "כניסה ב-1.9, מחיר 2100.\n" +
//                "\n" +
//                "בר - 054-2334243\n" +
//                "בעלת הדירה - יסמין - 052-6748558");
//        serviceConnector.getBridge().newPostFromAdmin("אביב גפן","דירת 4 חדרים מוארת,מרוהטת ומשופצת (כולל חלונות, ריצוף, מטבח, מקלחת, שירותים, צנרת, מזגנים) ל-3 שותפים ביצחק שיפר 6 (שכונת ו' הישנה), במיקום מעולה וסטודנטיאלי, צמוד לרינגלבלום, לברים ולמקומות הבילוי, במרחק הליכה מהאונ'. אזור שקט ונקי, קרוב לתחבורה ציבורית (לת\"א) ולמרכז מסחרי נוח (מרכז אורן). \n" +
//                "פירוט הריהוט: מקרר, מ.כביסה, כיריים, מיקרוגל, טוסטר אובן, פינת אוכל, ספה ושולחן סלון, טלוויזיה. בכל חדר מיטה, מזרן, ארון, שולחן וכיסא.\n" +
//                "מזגן חדש בכל אחד משלושת החדרים והסלון.\n" +
//                "מחיר: 3000 ש\"ח \n" +
//                "ת.כניסה: 1.9\n" +
//                "65 מ\"ר, קומה 2. \n" +
//                "טלפון: 054-4251615");
//        serviceConnector.getBridge().newPostFromAdmin("אייל גולן","להשכרה דירת 4 חדרים בוינגייט 62, קומה 3 מתוך 4. הבנין ממוקם במרחק של דקות הליכה מהאוניברסיטה (דרך בי\"ח סורוקה).\n" +
//                "הדירה מתאימה ל-3 שותפים/ות, מרוהטת מלא, סלון, מיטה ארון ושולחן בכל חדר, מיזוג בסלון ובכל חדר, מקרר חדש, מטבח כיריים גז, דוד שמש, ועוד.\n" +
//                "בכל חדר יש מזגן וחלונות מרושתים (בלי חרקים מעופפים), שולחן כתיבה, מיטה זוגית + מזרון, ארון.\n" +
//                "הדירה פונה לכיוון ביה\"ח (צפון) ולא לרחוב.\n" +
//                "בכניסה לבנין ישנו קודן ומחסן לאופניים. לבעלי רכב ישנה חניה ענקית ליד הבנין. \n" +
//                "מחיר 3000 ש\"ח.\n" +
//                "כניסה: 1/9/2018.\n" +
//                "לפרטים: משה 054-9993810\n" +
//                "\n");
//        serviceConnector.getBridge().newPostFromAdmin("אדיר מילר","ברחוב חז\"ל 94 בשכונה ב , במתחם לסטודנטים, יחידת דיור ומקסימה ברמה גבוהה, בת 2 חדרים ועוד מטבח עם פינת אוכל, מתאימה ליחיד/לזוג.\n" +
//                "ביחידה ריהוט כמעט מלא ,סורגים ורשתות בחלונות וגינה להנאת הדיירים.\n" +
//                "ארנונה 137 ש\"ח לחודש\n" +
//                "שכר דירה 2,100 ש\"ח\n" +
//                "לפרטים: 052-3278473");
//        serviceConnector.getBridge().newPostFromAdmin("מור צחורי","ברחוב חז\"ל 94 בשכונה ב במתחם לסטודנטים, יחידת דיור קטנה ומקסימה ברמה גבוהה , בת 3 חדרים מתאימה ליחיד/לזוג.\n" +
//                "ביחידה ריהוט כמעט מלא ,סורגים ורשתות בחלונות והעיקר גינה פרטית.\n" +
//                "ארנונה 165 ש\"ח לחודש\n" +
//                "שכר דירה 2,350 ש\"ח\n" +
//                "לפרטים: 052-3278473\n");
//        serviceConnector.getBridge().newPostFromAdmin("בתאל קליין","דירת 2 חד' משופצת ויפה ברח' שועלי שמשון 2 פינת ארלוזורוב ופינת וינגייט קומה ראשונה .קרובה מאד מאד לאוניברסיטה לבית חולים ולרכבת. בדירה סלון +חדר גדול במיוחד שתוכנן בצידו האחד כחדר שינה ובצידו השני כחדר לימודים . בדירה 2 מזגנים. מרוהטת : ספת סלון, שולחן סלון, שולחן אוכל, מקרר, מיטה זוגית, שולחן לימודים ,ארון בגדים. גודל הדירה כ 50מ\"ר.\n" +
//                "ארנונה לחודשיים 130 שח. שכר דירה 2300 ש\"ח לחודש .כניסה 1.9.18 (אפשרי 1.8.18) כדאי לראות ולהתרשם\n" +
//                "לפרטים יהודית 0524382446");
//        serviceConnector.getBridge().newPostFromAdmin("קלרית פרנצ'ס","לזוג או ליחיד דירת קרקע משופצת 2 חד' :חדר שינה +סלון מרווח ברח ' גוש עציון 34 פינת כרמלי. הדירה קרבה מאד לאוניברסיטה ,לרכבת ולבית חולים. \n" +
//                "בדירה 2 מזגנים. מכונת כביסה ,מקרר, כיריים גז, ספת סלון, מיטה זוגית, ארון, שולחן לימודים, שולחן אוכל עם 4 כסאות.\n" +
//                "גודל הדירה כ 45 מ\"ר. ארנונה 40 שח לחודש. כניסה 1.9.18 (אפשרי להקדים עד 1.7.18 ) שכ\"ד 2200 שח . כדאי לראות ולהתרשם\n" +
//                "לתאום: יהודית 0524382446");
//        serviceConnector.getBridge().newPostFromAdmin("משי קליינשטיין","רחוב רינגלבלום המבוקש!!\n" +
//                "ל השכרה דירת סטודנטים 3 חדרים מתאימה לשני שותפים סמוך לאוניברסיטת בן גוריון! - 2300 שח בלבד.\n" +
//                "בדירה 2 חדרי שינה וסלון. ממוקמת ברחוב רינגלבלום 110. נמצא במרחק 5 דקות הליכה בלבד משער 90 !! דירה נקייה ומסודרת\n" +
//                "בקרבת הדירה כל הברים והמסעדות של רינגלבלום ומרכז אורן.\n" +
//                "בדירה ריהוט :\n" +
//                "כל חדר : עם מזגן , מיטה +מזרן ,שולחן כתיבה,ארון.\n" +
//                "במטבח : מקרר, כיריים שולחן ועוד..\n" +
//                "בסלון : מזגן ספה ושידת טלוויזיה\n" +
//                "זמינה לכניסה החל מתאריך ה 01/09 \n" +
//                "מראים את הדירה בימים ראשון ורביעי 17:00 - 18:00 כל שבוע. כך שאין צורך לתאם :-)\n" +
//                "\n" +
//                "לפרטים נוספים : דרור 050-5070286");
//        serviceConnector.getBridge().newPostFromAdmin("רמי קליינשטיין","להשכרה - מתפנה דירת 4 חדרים חמודה בוינגייט 58 (החדש) ,קומה ראשונה. מתאימה לשלושה שותפים\\ות.בדירה: 4 מזגנים - מזגן בסלון ובכל אחד משלושת חדרי השינה (לא מיני מרכזי). ריהוט מלא: סלון 2+3, טלויזה, פינת אוכל + 3 כסאות, מקרר, תנור + כיריים. בחדרים ריהוט מלא: מיטה + מזרון, ארון, שולחן כתיבה (חסר רק כסא). בדירה שני חדרים גדולים ואחד בינוני (לא הקטן של וינגייט הגבוהים).\n" +
//                "תאריך כניסה 19.9.2018\n" +
//                "מחיר כולל: 3200 ש\"ח.\n" +
//                "לחדר גדול : 1,100 ש\"ח.\n" +
//                "לחדר בינוני: 1,000 ש\"ח\n" +
//                "לתיאום ביקור: שחר 0506226193 (עדיף לשלוח הודעה).");
//        serviceConnector.getBridge().newPostFromAdmin("ריטה","\n" +
//                "מתפנה דירת 3 שותפים שווה במיוחד ברחוב מצדה 61\n" +
//                "הדירה משופצת, 5 חדרים, שני חדרי שירותים, אמבטיה, מכונת כביסה, מרפסת שירות, סלון מרווח, מטבח חדש ומאובזר ששופץ ממש לאחרונה. \n" +
//                "בכל חדר ארון ומזגן פרטי\n" +
//                "שכ\"ד הוא 1250 לחדר , כניסה ב1.9 \n" +
//                "פרטים אצל דפנה אור 0522623865\n");
//        serviceConnector.getBridge().newPostFromAdmin("נועם לוגסי","\n" +
//                "יום רביעי 20/6 21:00 -20:00. בית פתוח. דירת 4 חדרים. מתאימה ל-3 שותפים או משפחה. במרחק 2 דקות משער 90 ודקה ממרכז החנויות ברינגלבלום!\n" +
//                "בנימין מטודלה 12. קומה ראשונה (לא קרקע) דירה בצד ימין. כניסה גמישה מאוד. 1050 ש\"ח לשותף גם אם אין לכם שותפים.\n" +
//                "הדירה מרוהטת לחלוטין וכוללת:\n" +
//                "* מטבח הכולל תנור, גז, מקרר\n" +
//                "* פינת אוכל + כסאות\n" +
//                "* סלון הכולל ספות, טלויזיה, שולחן ומזגן\n" +
//                "* מכונת כביסה\n" +
//                "* בכל חדר ארון בגדים גדול! מיטה זוגית, מזרן, שולחן כתיבה, כסא ומזגן\n" +
//                "לשאלות הרגישו חופשי להתקשר 052-3725746");
//        serviceConnector.getBridge().newPostFromAdmin("נועם אמור","\n" +
//                "*דרושה שותפה*\n" +
//                "מנסיבות משמחות עוזבת את הבית שלי עם השותפות המושלמות Lee Elihav Stav Shahar ומי שתיכנס זוכה בכל היופי הזה:\n" +
//                "\n" +
//                "דירת קרקע ארבעה חדרים (שלושה שותפים) מהממת ומשופצת, ברחוב משעו\"ל ביתר 6 (מצדה 54).\n" +
//                "בחדר המדובר יש שירותים ומקלחת פרטיים!!! ארון, שולחן ומיטה- בקיצור רק להביא בגדים! :) בדירה יש מרפסת קטנה וכל זה רק ב- 1,200 ש\"ח! כניסה ב 1.10 עם אפשרות להקדים.\n" +
//                "הדירה נמצאת באזור סטודנטיאלי ושקט, בניין נקי ומסודר עם מקלט, 5 דק' ממרכז הנגב, במרחק 15 דק' הליכה מהאוניברסיטה. צמוד לבניין יש ירקן ומכולת. \n" +
//                "מחפשות שותפה לא מעשנת, נקייה ומסודרת עם וייב טוב :)\n" +
//                "\n" +
//                "אז אם בא לך בית באווירה ביתית וכייפית מוזמנת לדבר איתנו בפרטי- עדיף בהודעות:\n" +
//                "אור- 0526810244\n" +
//                "לי- 0547335499\n" +
//                "סתיו- 050-553611");
//        serviceConnector.getBridge().newPostFromAdmin("שיר אליאס","מפרסמת בשביל בעל הדירה:\n" +
//                "מתפנה דירה מושלמת!\n" +
//                "בעוזיהו המלך 24 שכונה ד', קומה 3.\n" +
//                "5 דקות מהאוניברסיטה.\n" +
//                "\n" +
//                "דירת 3 חדרים גדולה ומרווחת לזוג.\n" +
//                "סלון ומטבח גדולים. \n" +
//                "חדר שינה.\n" +
//                "חדר עבודה/לימודים.\n" +
//                "מזגנים חדשים בכל החדרים. \n" +
//                "מקרר, ארון ופינת אוכל (לא זו שבתמונה אבל חדשה) נשארים.\n" +
//                "2400 ש\"ח לחודש. חוזה לשנה, כניסה ב1/9, יש אפשרות לבע״ח. בעל בית מקסים וגמיש.\n" +
//                "050-5647484 נטלי\n" +
//                "054-6966697 רם\n" +
//                "לתיאום הגעה ופרטים נוספים- לפנות לטלפונים הנ״ל-עדיפות לווסטאפ\n" +
//                "(אני לא קשורה לדירה)");
//        serviceConnector.getBridge().newPostFromAdmin("שיר אלמליח","\n" +
//                "**דירה שלמה מתפנה**\n" +
//                "\n" +
//                "אנחנו מפנות את הדירה שלנו ואתם זוכים ;)\n" +
//                "דירת 3 שותפים בסוסו הכהן 9,קומה 2.5 (4 מדרגות לקומה הראשונה)\n" +
//                "5 ד' הליכה לשער רגר ולשער 90\n" +
//                "בדירה שירותים ומקלחת נפרדים, סלון ענק, מרווחת ממש\n" +
//                "במטבח נשאר תנור, מיקרוגל, מקרר וכל הדברים הבסיסיים\n" +
//                "בכל חדר נשאר בסיס מיטה ומזרן, מזגן, שולחן וארון\n" +
//                "בעל דירה חדש ומקסים\n" +
//                "3300 לחודש לכל הדירה\n" +
//                "\n" +
//                "כניסה ב4.9\n" +
//                "לפרטים נוספים:\n" +
//                "אביב - 0524501202\n" +
//                "ניתן לבוא לראות בתיאום מראש ");
//        serviceConnector.getBridge().newPostFromAdmin("נוי והדר","הי, לכל מי שהתעניין...היום (רביעי) 18:00-19:00, נעמי (0547339433) תראה את הדירה (יש אפשרות גם מחר בערב ושישי בוקר).\n" +
//                "\n" +
//                "דירה מקסימה!!! בוינגייט 68. משופצת ונעימה. כוללת מטבח חדש, ריצוף חדש, ספות סלוניות חדשות, אמבטיה חדשה. ובנוסף: תנור, מקרר, פינת אוכל וכסאות (שולחן נפתח), מזגנים בחדרי שינה ובסלון, ארון גדול בכל חדר שינה (8 דלתות, נהדר לאחסון), דוד שמש.\n" +
//                "הדירה בקומה 4 עם נוף שפונה לפארק. 3 חדרים, מתאימה לזוג. 2,700 ₪ לחודש.\n" +
//                "ניתן לראות את הדירה בתיאום מראש בשעות אחה\"צ/ערב וכן בימי שישי בבוקר.\n" +
//                "שרית 0508835718.");
////        serviceConnector.getBridge().newPostFromAdmin("פנינה ניסים","");
////        serviceConnector.getBridge().newPostFromAdmin("עידן הבלר","");
////        serviceConnector.getBridge().newPostFromAdmin("נמרוד האריס","");
////        serviceConnector.getBridge().newPostFromAdmin("גל אמיתי","");
////        serviceConnector.getBridge().newPostFromAdmin("שיר ברנר","");
////        serviceConnector.getBridge().newPostFromAdmin("ספיר סימון","");
////        serviceConnector.getBridge().newPostFromAdmin("עדי אלון","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
////        serviceConnector.getBridge().newPostFromAdmin("","");
//
//        serviceConnector.getBridge().connectToTestDB();
//    }

    @AfterClass
    public static void endup() {
        serviceConnector.getBridge().disconnectToTestDB();
    }

}
