package il.ac.bgu.finalproject.server.AcceptanceTests;


import il.ac.bgu.finalproject.server.CommunicationLayer.AdminDTOs.NewPostDTO;
import il.ac.bgu.finalproject.server.Domain.Controllers.MyLogger;
import il.ac.bgu.finalproject.server.Domain.DomainObjects.UserSearchingUtils.ResultRecord;
import org.testng.Assert;
import org.testng.annotations.AfterClass;
import org.testng.annotations.BeforeClass;
import org.testng.annotations.Test;

import java.util.logging.Level;

public class newPostFromAdminTests {
    private static ServiceConnector serviceConnector;

    @BeforeClass
    public static void setup() {
        serviceConnector= new ServiceConnector();
        serviceConnector.getBridge().connectToTestDB();
    }

    @Test
    public void newGoodPostFromAdmin(){
        int x= serviceConnector.getBridge().newPostFromAdmin("publisher","דירת 2.5 חדרים קרקע בבר גיורא 21 בד'. \n" +
                "מחיר סופר הוגן- שימו לב כי תעלם מהר⏳\n" +
                "✅ 2100 לחודש.\n" +
                "✅חדשה ונדירה! מתאימה לזוג סטודנטים או יחיד/ה. לא לשותפים.\n" +
                "✅מרווחת (45 מ\"ר) עם כניסה נפרדת (!) מגינה גדולה פרטית כולל שער ננעל. \n" +
                "✅שני צעדים מכיכר האבות. 600 מטר מהאוניברסיטה. משופצת מלא כולל אינסטלציה וחשמל. איזור מלא סטודנטים.\n" +
                "✅חדר שינה ענק, סלון ומטבח בחלל אחד גדול וכיפי וחדר עבודה חמוד.\n" +
                "כולל: שני מזגנים, פלדלת, שולחן כתיבה, תנור, מקרר חדש, כיריים, שולחן בר ,תאורה לגינה, דודש, סורגים ורשתות על כל החלונות, הכנה ומקום למכונת כביסה. בחדר שינה: פרקט פורצלן, מיטה זוגית, מזרון, שידות וארון חדש לבן 6 דלתות.\n" +
                "\uD83C\uDFCB️\u200D♂️ארנונה 70 לחודש. אין ועד בית ואתם לא רואים תחדר מדרגות או תשכנים אם לא בא לכם. \n" +
                "\uD83C\uDFCB️\u200D♀️*לא* יחידת דיור ולא דירה מחולקת לכן המחיר לא כולל חשמל או מים.\n" +
                "\uD83C\uDFCB️\u200D♂️מתפנה 1 ספטמבר 2018. חוזה רגיל לשנה עד 31.8.19 . \n" +
                "⌛אפשר לבוא לראות- לתאם בפרטי או בוואטסאפ: קרן 054-7774292");
        Assert.assertTrue(x!=-1);
        ResultRecord resultRecord= serviceConnector.getBridge().ResultRecordFromDB(""+x);
        Assert.assertEquals(resultRecord.getCost(),2100);
        Assert.assertEquals(resultRecord.getNumber(),21);
        Assert.assertEquals(resultRecord.getStreet(),"שמעון בר גיורא");
        Assert.assertEquals(resultRecord.getSize(),45);
        Assert.assertEquals(resultRecord.getFurniture(),1);
        Assert.assertEquals(resultRecord.getNeighborhood(),"שכונה ד'");
    }

    @Test
    public void newPostFromAdminPhoneIsMissing() {
        int x = serviceConnector.getBridge().newPostFromAdmin("publisher", "דירת 2.5 חדרים קרקע בבר גיורא 21 בד'. \n" +
                "מחיר סופר הוגן- שימו לב כי תעלם מהר⏳\n" +
                "✅ 2100 לחודש.\n" +
                "✅חדשה ונדירה! מתאימה לזוג סטודנטים או יחיד/ה. לא לשותפים.\n" +
                "✅מרווחת (45 מ\"ר) עם כניסה נפרדת (!) מגינה גדולה פרטית כולל שער ננעל. \n" +
                "✅שני צעדים מכיכר האבות. 600 מטר מהאוניברסיטה. משופצת מלא כולל אינסטלציה וחשמל. איזור מלא סטודנטים.\n" +
                "✅חדר שינה ענק, סלון ומטבח בחלל אחד גדול וכיפי וחדר עבודה חמוד.\n" +
                "כולל: שני מזגנים, פלדלת, שולחן כתיבה, תנור, מקרר חדש, כיריים, שולחן בר ,תאורה לגינה, דודש, סורגים ורשתות על כל החלונות, הכנה ומקום למכונת כביסה. בחדר שינה: פרקט פורצלן, מיטה זוגית, מזרון, שידות וארון חדש לבן 6 דלתות.\n" +
                "\uD83C\uDFCB️\u200D♂️ארנונה 70 לחודש. אין ועד בית ואתם לא רואים תחדר מדרגות או תשכנים אם לא בא לכם. \n" +
                "\uD83C\uDFCB️\u200D♀️*לא* יחידת דיור ולא דירה מחולקת לכן המחיר לא כולל חשמל או מים.\n" +
                "\uD83C\uDFCB️\u200D♂️מתפנה 1 ספטמבר 2018. חוזה רגיל לשנה עד 31.8.19 . \n" +
                "⌛אפשר לבוא לראות- לתאם בפרטי או בוואטסאפ");
        Assert.assertEquals(x ,-2);
    }

    @Test
    public void newPostFromAdminFullAddressIsMissing() {
        int x = serviceConnector.getBridge().newPostFromAdmin("publisher", "דירת 2.5 חדרים קרקע בבר גיורא בד'. \n" +
                "מחיר סופר הוגן- שימו לב כי תעלם מהר⏳\n" +
                "✅ 2100 לחודש.\n" +
                "✅חדשה ונדירה! מתאימה לזוג סטודנטים או יחיד/ה. לא לשותפים.\n" +
                "✅מרווחת (45 מ\"ר) עם כניסה נפרדת (!) מגינה גדולה פרטית כולל שער ננעל. \n" +
                "✅שני צעדים מכיכר האבות. 600 מטר מהאוניברסיטה. משופצת מלא כולל אינסטלציה וחשמל. איזור מלא סטודנטים.\n" +
                "✅חדר שינה ענק, סלון ומטבח בחלל אחד גדול וכיפי וחדר עבודה חמוד.\n" +
                "כולל: שני מזגנים, פלדלת, שולחן כתיבה, תנור, מקרר חדש, כיריים, שולחן בר ,תאורה לגינה, דודש, סורגים ורשתות על כל החלונות, הכנה ומקום למכונת כביסה. בחדר שינה: פרקט פורצלן, מיטה זוגית, מזרון, שידות וארון חדש לבן 6 דלתות.\n" +
                "\uD83C\uDFCB️\u200D♂️ארנונה 70 לחודש. אין ועד בית ואתם לא רואים תחדר מדרגות או תשכנים אם לא בא לכם. \n" +
                "\uD83C\uDFCB️\u200D♀️*לא* יחידת דיור ולא דירה מחולקת לכן המחיר לא כולל חשמל או מים.\n" +
                "\uD83C\uDFCB️\u200D♂️מתפנה 1 ספטמבר 2018. חוזה רגיל לשנה עד 31.8.19 . \n" +
                "⌛אפשר לבוא לראות- לתאם בפרטי או בוואטסאפ: קרן 054-7774292");
        Assert.assertEquals(x ,-3);
    }

    @Test
    public void newPostFromAdminFullOneline() {
        int x = serviceConnector.getBridge().newPostFromAdmin("publisher","רחוב מצדה 6 טלפון 0533391800");
        Assert.assertEquals(x ,-3);
    }

    @Test
    public void checkgson(){
        MyLogger.getInstance().log(Level.SEVERE,"jkjhhj");
//        String s= "{\"publisherName\":\"גשדגדש\",\"messege\":\"\\r\\nמפנה את החדר שלי בדירה הכי קרובה לאוניברסיטה- רגר 105 \uD83D\uDE0A\\r\\nבדירה נשארים Nofit Drihem Saar Yazdi והם מחפשים שותפה!\\r\\nדירת 4 חדרים, קומה שניה, ממש מול האוניברסיטה.\\r\\nהדירה מרוהטת ב100%  כל הריהוט בחדר, סלון, פינת אוכל, טלוויזיה, מכונת כביסה... \\r\\nסלון ענק, פינת אוכל ענקית, מטבח ענק. \\r\\nכל התענוג הזה ב1050  אין מחיר כזה על רגר!! \\r\\n* כניסה באוגוסט\\r\\n* מסיימת שנה א' ומעלה\\r\\n* לא מעשנת\\r\\nלפרטים ולתיאום- בפרטי או בטלפון 0523782638\",\"tokenDTO\":{\"userName\":\"admin\",\"password\":\"123456\"}}";
////        Gson gson = new Gson();
//        NewPostDTO newPostDTO = NewPostDTO.fromJSON(s);
//        System.out.println(newPostDTO.getPublisherName());
//        System.out.println(newPostDTO.getMessege1());

    }

    @Test
    public void insertALot(){
        serviceConnector.getBridge().disconnectToTestDB();
        serviceConnector.getBridge().newPostFromAdmin("shlomi arzi","השותפה המקסימה שלנו Yarden Peretz עוזבת את הדירה. אני וGal Ben Maman מחפשים מישהי שתחליף את מקומה בחדר. דירת 4 חדרים חדשה משופצת לחלוטין עם חצר ענקית. הדירה באלעזר בן יאיר 16 כרבע שעה מאוניברסיטה. הדירה מרוהטת ויש בה הכל, רק להביא בגדים ולהכנס. עלות 1150 ש\\\"ח. כניסה מיידית :)\\nלפרטים:\\n0526516656\\n");
        serviceConnector.getBridge().newPostFromAdmin( "yoni bloch","להשכרה ללא עמלת תיווך! בשכונה ה', מגדלי עופר, רחוב ש\\\"י עגנון. דירת 5 חדרים יפה, גדולה ומרווחת. מטבח גדול, פינת אוכל מוגדרת, סלון מרווח חדרי שינה גדולים 3 שירותים 2 מקלחות יחידת הורים. בניין שמור נקי ומטופח עם 2מעליות ו 2 חניות פרטיות. גישה לנכים, מעולה למשפחה גדולה, שכ\\\"ד 4000 ש\\\"ח, כניסה מיידית! לפרטים נוספים נא ליצור קשר בנייד: 054-5533351 יריב. כניסה מיידית!\\" );
        serviceConnector.getBridge().newPostFromAdmin( "omer adam","למכירה בשכונה ד ברחוב דוד המלך חדר וסלון 50 מ\\\"ר קומה 3/4\\nבמחיר חסר תקדים רק 480.000 ש\\\"ח הדירה נמצאת בקרבת האוניברסיטה מרחק הליכה ברגל 8 דקות\\nלפרטים נוספים וסיור בנכס\\nתיווך אדיר - אדיר 0506796969\\n" );
        serviceConnector.getBridge().newPostFromAdmin("dani shovevani"," \"לסטודנטים שנזכרו מאוחר!\\nרגר 163\\n4 חדרים\\n100 מ\\\"ר (לפי טופס ארנונה)\\n3300 ש\\\"ח\\nדירה מרווחת מאוד ומפנקת,מול גן סיאטל,קומה  4(לא על עמודים),הדירה מאובזרת במכונת כביסה חדשה, תנור משולב עם כריים,מקרר ומרוהטת מלא למעט 2 מזרונים.\\n*ללא עמלת תיווך לסטודנטים\\nאיציק 0547334682 *עדיפות לוואטסאפ!\\nאיציק ויהב- מתווכים\\n\",\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ben arzi","להשכרה 3 חד' בשכונת יא' ברחוב שיטרית קומה 3 מ4\nללא ריהוט כניסה 1/12\nרק 1900 שח\n0503403041 עופר\n" );
        serviceConnector.getBridge().newPostFromAdmin( "avichai yadin","יחידת דיור 2 חדרים להשכרה בשכונה ב' רחוב בצלאל 20 חמש דקות הליכה למכללת סמי שמעון וקרובה מאוד למרכז חן. היחידה מרוהטת. 2150 כולל מים וארנונה וחשמל עד 150 שח לחודש. לכניסה מיידית .\n" );
        serviceConnector.getBridge().newPostFromAdmin("faisel molich","דירה לאחר שיפוץ מלאאא!!!\nדירת 4 חדרים מקסימה ברחוב אברהם אבינו 26, שכונה ד' במרחק של 7 דקות הליכה משער רגר. מתאימה ל-2 שותפים או לזוג שרוצה להתפנק ?? הדירה מרוהטת קומפלט (מקרר,מיקרוגל,תנור,כיריים,מטבח חדש,מזגנים חדשים, סלון,שולחנות לימוד,שולחן פינת אוכל וכיסאות, מיטות וארונות).\nמיקום מרכזי, מול מרכז קניות, תחנת אוטובוס מתחת לבית וקרוב לאזורי הבילויים.\nשכ\"ד-2400 ש\"ח.\nזמין בפרטי\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ronen harazi","דירת 3 חדרים ברגר\n₪2,500 - ‎אוניברסיטת בן-גוריון בנגב‎\n\nלהשכרה דירת 60 מטר ברגר 163\nשמורה\nחדרים מרווחים\nסלון מרווח\n-חצר\n-ריהוט לפי הדרישה\n-כניסה מיידיצ\n-2500\n-לתיאום-0525447662\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ben aflalo","דירה יפייפיה להשכרה\nברחוב גוש עציון 25\n8 דקות הליכה מהאוניברסיטה\n2 חדרים 35 מ\"ר\nחצר פרטית עם חניה 60 מ\"ר\n2000 ש\"ח כולל מים וארנונה\n050-8693633\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dor malol","?????? הקשיבו הקשיבו ??????\nבית החלומות נמצא ממש פה מהרו לפני שלא ישאר מקום !!!\nסמטת יהונתן מיקום פצצה !!!\nדירת   4 חדרים יפייפיה משופצת מהייסוד! מוארת ונעימה !\nמרוהטת קומפקלט!\n מה יש בה ?\n? חדרים ענקיים בכל חדר יש מיטה ארון ושולחן\n ? מטבח יפייפה וגדול\n ? טלוויזיה\n ? פינת אוכל בנפרד\n ? שירותים + מקלחת\n ? שירותים בנפרד נוספים\n ? מכונת כביסה\n ? תנור\n1100 לשותף\n# נמצאת בשכונה ד' רחוב סמטת יהונתן על גבול ב'\nדירה ברמה גבוהה רק נשאר להביא בגדים ולהכנס ?\nלתיאום ושאלות נוספות מוזמנים ליצור קשר במספר הבא\n 054 - 2818529 רננה\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dikla green","דירת 4 חדרים משופצת ומרוהטת במשעול יודפת כניסה מיידית לפרטים נוספים רועי 0544218258\n" );
        serviceConnector.getBridge().newPostFromAdmin("shalom asyag","יחידת דיור להשכרה בשכונה א\n1850 ש\"ח כולל מים וארנונה\nרחוב אוסישקין 2\nקומה 4 מתוך 4\n30 מ\"ר\nמשופצת\nכניסה ב1/10\n2 חדרים\nמרוהטת: מיטב זוגית, שידה, שידת טואלט ומראה, סלון, שולחן וכיסא,\nמקרר, כיריים, מכונת כביסה, שני מזגנים.\n4 דקות הליכה מסמי שמעון\n050-8693633\n" );
        serviceConnector.getBridge().newPostFromAdmin( "nimrod shoval","דירת 2.5 חד' מרווחת 50 מטר פלוס גינה במכתשים 22\nמרוהטת קומפלט מיטה זוגית\nכל מכשירי החשמל (תנור משולב עם כיריים גז, מקרר, מכונת כביסה)\nארון קיר בעל בית דואג להכול היחידה עברה שיפוץ מרחק הליכה לאוניברסיטה.\n\nמתאימה לזוג סטודנטים או זוג עם ילד מחיר לדירה 2500 כולל כול החשבונות למעט חשמל טלפון ליצירת קשר איוון :0542033228\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ron doron","מפרסמת בשביל בעל הבית:\nלהשכרה דירה בווילות מצדה :4 חדרים+ מרפסת ענקית, משופצת ומרוהטת קומפלט. מחיר 3,000 ש\"ח לא כולל חשבונות.\nכניסה ב20.11.2017.ללא בעלי חיים! לפרטים מבקשת ליצור קשר עם בעלי בית: 052-3783637\n" );
        serviceConnector.getBridge().newPostFromAdmin( "nofar naftchi","**אמ:לק; נשאר חדר יחיד ב-1050 ש\"ח בשכונה ב, ביאליק 24**\nבשכונה ב' השקטה והחביבה מתפנה חדר בדירת 5 חדרים גדולה ומרווחת, רח' ביאליק 24 בבניין יפהפה וצעיר (יחסית :) ) עם 2 מעליות, מקלט בקומה וחניה פרטית. כרגע בדירה 3 שותפות שמחפשות את הרביעית המשלימה!\nבדירה - סלון ומטבח ענקיים, חדר שירות, ומרפסת קטנה וחמודה!\nקיים מזגן בכל חדר שינה וכן מזגן גדול בסלון. ריהוט חלקי (מיטה וארון) בחדרים, סלון מלא כולל פלזמה, ומטבח מרווח ומפנק לחובבי הבישול - כולל תנור, כיריים ומקרר חדש.\n*הדירה ממוקמת מעל מרכז חן/ביאליק, הכולל מכולת, ירקן, מאפיה, פיצריה ויש אוטובוסים לכל מקום לעצלנים *\nמבחינת מרחק מהאוניברסיטה - בהליכה מדובר בכרבע שעה עד 20 דקות. באופניים 5-7 דקות, וכאמור יש תחנת אוטובוס מתחת לדירה שמגיעה לאוניברסיטה.\nלסטודנטים בסמי והמכללה הטכנולוגית - אפשר לקום 5 דקות לפני תחילת השיעור ועוד להספיק לקפה.\nבדירה שומרים כשרות.\nכניסה מיידית.\nלתיאום מראש להגעה - יש ליצור קשר בפרטי.\nאו בניידים:\nשיר-0545446792\nכרמל-0543055096\n" );
        serviceConnector.getBridge().newPostFromAdmin( "tamir shmilovich","דירה להשכרה!\nויינגייט 12...\nדירה גדולה ומרווחת... 3 חדרי שינה שירוקלחת ושירותים נוספים\nמתאימה מאד ל3 שותפים.\nקרובה מאד לרכבת צפון ולכניסה הצפונית לאוניברסיטה.\nכולל ריהוט מלא בכל החדרים - שולחן, מיטה וארון בכל חדר!\nשכ\"ד 2700 ש\"ח\n054-9435353\nמראים היום ב21:30\n" );
        serviceConnector.getBridge().newPostFromAdmin( "shavit chernihov","להשכרה דירה חדשה מהניילונים!!!\nפרויקט חדש של ארזי הנגב ברמות בן 5 חודשים רח' גדעון האוזנר ברמות דירת 4 חדרים + מרפסת 14.5 מטר\nקומה 3 מתוך 5\nתקרה גבוהה 3.20, מטבח משודרג של PANEL\nדלתות פנדור לבנות, רשתות + תריסים חשמליים בכל הבית, ממוזגת, חניה, מעלית ופינת אוכל מוגדרת.\nרק 2 דיירים בקומה, ללא שטחי מסחר מתחת!\nקרובה לבתי הספר ובקרבת הגנים, יציאה מהירה לכביש תל אביב ולכביש 6\nכל הקודם זוכה, כניסה מיידית!\nשכירות 3800₪\nוועד בית 240₪\nארנונה 940₪\n\nלפרטים נוספים אך ורק בנייד:\n054-320-6958\n" );
        serviceConnector.getBridge().newPostFromAdmin( "omer shoshan","להשכרה בשאול המלך 141\nדירת 2 חדרים יפהפייה, משופצת ומרוהטת קומפלט (ספות, שולחנות, מיטה זוגית, ארונות קיר, תנור, מקרר, מכונת כביסה, מזגן, וכל מה שצריך).\nהמחיר - 1900 לחודש כולל מים, ארנונה וועד בית\nלפרטים - 0522353174 זיו\n" );
        serviceConnector.getBridge().newPostFromAdmin( "naor ashkenazi","להשכרה בשכונה ה בני אור 40 קומה 3 מתוך 5 ללא מעלית, דירה גדולה ומרווחת.\nדירת 4 חדרים שלושה חדרי שינה, וסלון + חדר ארונות בנוסף ישנה מרפסת שירות.\nדירה מרווחת, מתאימה לשותפים או למשפחה, ריהוט חלקי\nמחיר: 2900 ש\"ח\nלפרטים:\nאביבית - 0502225392\nאבי - 0507289757\n" );
        serviceConnector.getBridge().newPostFromAdmin( "liron feliss","*** דירה ליחיד/ זוג ב1700 ***\n\nדירה מקסימה כ-35 מ\"ר בארלוזורוב 14- 10 דקות מהאוניברסיטה ומסורוקה.\nבדירה חדר שינה גדול הכולל מיטה זוגית, ארון ושידה.\nבסלון- ספה, מכונת כביסה, כיריים חשמליות, מקרר, שולחן אוכל.\nבנוסף יש מרפסת קטנה מיוחדת עם מתלה כביסה ושימושים אחרים ??\nכניסה מידית.\nלפרטים נוספים ותיאום מראש:\nספיר- 0505359900 (זמינה בוואטאפ)\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dafna armoni","מראים את החדר היום בערב !\nמתפנה חדר באלעזר בן יאיר במחיר 1150 ש\"ח הדירה חדשה, חצר מדהימה ו2 שותפים לא פחות ממושלמים לפרטים נוספים בפרטי??\n" );
        serviceConnector.getBridge().newPostFromAdmin("shlomi shabat","השותפה שלי החליטה לפרוש מהלימודים בבש ברגע האחרון, אז אנחנו מחפשות שותפה חדשה..\nמדובר על דירת בנות מקסימה בביאליק 24, דירה ענקית 160 מר 5 חדרים, מתאים ל4 שותפות...\nאנחנו מחפשות משהי שומרת כשרות עם ראשון טוב ??\nאם אתן מכירות משהי מתאימה תתיגו:))\n**תמונות ופרטים נוספים בפרטי**\nכרמל 0543055096\n" );
        serviceConnector.getBridge().newPostFromAdmin("shlomi shaban","להשכרה יחידת דיור 3 חד' קרקע עם גינה וכניסה פרטית\nברח' הכותל המערבי בשכונה א'\nריהוט מלא כולל הכל כניסה מידית\nמתאים ליחיד או זוג ללא בעלי חיים\nהמחיר 3000 כולל ארנונה ומים\nלפרטים רונן 050-5300038\n" );
        serviceConnector.getBridge().newPostFromAdmin( "nichal yanai","#חדשה_להשכרה! ??\nיחידת דיור מדהימה בשכונת נאות לון!\nכ-80מ\"ר בנוי, 2חדרים (חדר שינה גדול עם חדר ארונות + סלון מרווח מאוד), גינה של כ-40מ\"ר. #ריהוט_מלא!\n*ללא חיות מחמד\n3,500ש\"ח כולל הכל! חשמל, מים, גז, ארנונה, אינטרנט ו-yes.\nלפרטים נוספים : 054-3037805 נתי - ארץ עיר\nארץ עיר - נדל\"ן ויזמות\n" );
        serviceConnector.getBridge().newPostFromAdmin( "oded menashe","להשכרה דירת 2 חד'\n\nשכונה ד', רח' בר גיורא\n\n*ממוזגת\n*קומת קרקע\n*50 מ\"ר\n\nריהוט: בסיס מיטה + מזרן, מקרר, ארון 3 דלתות.\n\nכניסה מיידית.\n\nמחיר: 1,700 ש\"ח.\n\nלפרטים: 054-449-0025\n" );
        serviceConnector.getBridge().newPostFromAdmin( "roth sirkis","מפנה חדר אלעזר בן יאיר במחיר 1150 , משאירה אחריי שתי שותפים מדהימים הדירה חדשה ואחרי צבע לפרטים נוספים בפרטי??\n" );
        serviceConnector.getBridge().newPostFromAdmin( "yosef ben david","עקב קבלה ללימודים במוסד מרוחק אני נאלצת לעזוב את הדירה ומחפשת שותפה שתחליף אותי בחדר, המחיר הוא 1150 לחודש וכמובן 2 שותפים מדהימים!!! לעוד פרטים בפרטי??\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dan doron","מחפשת בשביל חברה שותף/ה בראש טוב! לדירה במצדה 43, קומה ראשונה (מעל הפסטינה) לשני שותפים, דירה גדולה ומשופצת, מרווחת,  במצב טוב, מתפנה חדר גדול ונחמד. בחדר נשארים שני ארונות ומדפים אבל חסרה מיטה. שכ'\"ד 2,400.\nמחפשת שותף/ה שרוצים לגור באווירה טובה, קלילה וחברית..\nלפרטים 0525834867 נוי\n" );
        serviceConnector.getBridge().newPostFromAdmin("bibi netanyhau","להשכרה : דירת 2.5 חד' קומה 4/4,משופצת מרוהטת ממוזגת.\n60 מטר ברחוב מבצע עובדה\n2000 ש\"ח.\nכניסה 15.10\n\"פרי נכסים\"\n0508812541\n" );
        serviceConnector.getBridge().newPostFromAdmin( "achmed tibi","***רינגלבלום 7***\nדירת 2 חד' 50 מ\"ר משופצת ומרוהטת עם מרפסת פנימית\nמתאימה לזוגות או ליחידים\nממש על הכניסה לרחוב בן מתתיהו ומטר מרגר\nרק 2000 ש\"ח!!\nאיתי 050-2516898\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dafna briliant","דירה להשכרה ברחוב רגר 126 (צמוד לרח׳ רינגנבלום) 3 חדרים ,משופצת כחדשה, קומת קרקע, כולל מרפסת (גינה -אפשר בעלי חיים) +מחסן. מאובזרת במוצרי חשמל רובם חדשים: מכונת כביסה, מקרר, כריים, תנור ,2 מזגנים וטוסטר אובן. מקלחת ושירותים חדשים, מטבח חדש .ארונות ומיטות זוגיות בחדרי השינה. לבית 2 כניסות אחת מהמרפסת והשניה מחדר המדרגות. 2 דקות הליכה מהאוניברסיטה (בקרבת שער 90 )\n2600 שח.\nלפרטים: 0525411144\n" );
        serviceConnector.getBridge().newPostFromAdmin( "yoel solomon","?דירה להשכרה הכי יפה בשכונה ג?\n₪ 3,300\nבאר שבע\nשכונה ג- דירת 4 חדרים- 1100 ש\"ח\nהדירה הכי יפה בשכונה ג'!\nדירת 4 חדרים, עברה שיפוץ קומלפט- הכל חדש!\nבנוסך, הדירה מרוהטת קומפלט! (בכל חדר: מיטה+ שולחן + כסא+ ארון+ מזגן- הכל חדש)\nבחלל המשותף: ספה, שולחן, שידה, LCD, מזגן, פינת אוכל, מכונת כביסה, מקרר, מיקרו, תנור, כיריים- הכל חדש מהניילונים!\nאמיר מנצור - יועץ נדל\"ן באר-שבע 360\nלתיאום - 054-5514300\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ronit pik","*********ללא תיווך!!************\nדירה להשכרה בשכונה ה' המתחדשת!!\nמילוס 12, קומה 2, 3 חדרים, ממוזגת, מטבח,מקלחת + שירותים משופצים. מתאימה למשפחות ושותפים.\nהדירה לא מרוהטת!\nישנה דרישה לצ'קים + ערב!\nשכ\"ד 2300 ש\"ח.\nלתאום נא ליצור קשר\nמקסים 052-345-7591\nאלי: 052-4848-414 { עדיפות לווטאסאפ }\n" );
        serviceConnector.getBridge().newPostFromAdmin( "zvika pik","דירה ענקית מוארת ומרווחת (96 מ\"ר) בת 3 חדרים (מרוהטת) מיועדת  לזוג סטודנטים, יחיד או משפחה. 2 חדרי שינה, סלון, חדר ארונות, מקלחת, שירותים, מרפסת שירות ומרפסת גדולה שמתחברת לסלון ולחדר.\nחניה פרטית לתושבי הבנין .\nשדרות שזר 19 שכונה ג' ,\n2 דק הליכה לבית הספר למשחק ,\nקרובה לאוניברסיטה למרכזי קניות ותחנת רכבת.\nמרוהטת . מטבח ומקלחת אחרי שיפוץ !\n2200 שקלים סה\"כ\nלשאלות ותיאומים - יובל - 052-470-8798\nמנחם- 050-6233-437\nהמשך יום טוב :)\n" );
        serviceConnector.getBridge().newPostFromAdmin( "boris klaiman","***מחפסת שותפים!!***\nסטודנטית מעוניינת בשני שותפים/שותפות נוספים,לדירת 5 חדרים מקסימה במבצע נחשון 76, צמוד למרכז גילת. (סהכ 3 שותפים)\n\n2 חדרים פנויים :\nחדר אחד עם שירותים ומקלחת פרטיים ( לחדר 1000₪)\nחדר נוסף עם מרפסת פרטית ונוף יפה. (לחדר 1100₪)\n\nדירה גדולה ומרווחת עם מטבח\nמאובזר (הרבה ארוחות שישי שוות) סלון מפנק וגדול עם מרפסת צמודה, חנייה פרטית ובריכה מקורה(כרגע לא בשימוש)\n\nמחפשת שותפים רציניים עם אנרגיות חיובית??\n\nאם מעניין אותכם שלחו לי בפרטי:\n0586823161\n" );
        serviceConnector.getBridge().newPostFromAdmin( "shavit elimelech","***כניסה במיידי***\n$$$גמישות במחיר$$$\nשתי שותפות מחפשות שותף/ה בבית קרקע מדהים??\n*בית קרקע שממוקם ברחוב האיסיים 16 בשכונה ד'.\n*3 חדרי שינה, סלון מאובזר ושירוקלחת ??\n*מרוהטת באופן מלא! שופצה בקיץ האחרון :)\n*שתי חצרות מקורות! (לישיבות בחורף בלי גשם) ?????\n*3150₪ לכל הבית! ??\n*בעל דירה אכפתי\n*כניסה מיידית!\nלפרטים: יער 0549747552\nVeronika Davidov 0543112881\n" );
        serviceConnector.getBridge().newPostFromAdmin( "shlomit soka","לרציניים בלבד, אני מפרסם את הדירה בשם בעל הבית,\nהדירה מתאימה לזוג או 2 שותפים,\n2500 ש\"ח כולל ארנונה\nעם 3 מזגנים מעולים וחסכוניים של אלקטרה אחד בכל חדר,\nארונות מטבח חדשים,\nדוד שמש סולארי,\nחלונות עם סורגים,\nחנייה בשפע,\nיש מרכול שכונתי קרוב לבית,\nהדירה קרובה למעון ילדים,\nהמחיר חודשי לא כולל מים וחשמל,\nתשלום לפי צריכה של מונה חשמל ומים פעם בחודשיים.\nגודל הדירה כ62 מ\"ר, החצר סגורה עם גג בגודל כ15 מ\"ר.\nליצירת קשר לשלוח לי הודעה בפרטי.\nהדירה נמצאת ברחוב אסירי ציון, שכונה ג' בבאר שבע\n" );
        serviceConnector.getBridge().newPostFromAdmin( "zevik pevik","בבאר שבע להשכרה במגדל הספורט החדש מול ביה\"ח סורוקה ובקרבת האוניברסיטה דירת 2 חדרים מרוהטת בקומה 7 כניסה 15.11.17 שכירות 2700 ש\"ח לתיאום יאיר 0528683499\n" );
        serviceConnector.getBridge().newPostFromAdmin( "john ogo","ללא עמלת תיווך! להשכרה ברחוב דויד המלך 31 דירת 3 חדרים יפייפיה גדולה ממוזגת,מרווחת ומרוהטת, התקנה של מטבח חדש בשלבי סיום, סלון גדול חדרי שינה גדולים מטבח פונקציונלי במרחק 10 דקות הליכה לאוניברסיטת בן גוריון מעולה לשותפים סטודנטים. כניסה מיידית!\nשכ\"ד 2100 ש\"ח!\nלפרטים / תאום: 054-5533351 יריב.\n" );

        serviceConnector.getBridge().newPostFromAdmin( "srolik prolik","\"דירה מרוהטת ?? משופצת ?? ליד האוניברסיטה??\\n??מראה את הדירה היום בתיאום מראש??\\n\uD83D\uDCF1לפרטים: תומר 054-5918161\\nמתאימה ל-3 שותפים. \uD83D\uDCA5החל מ-850 ש\\\"ח לחדר!\uD83D\uDCA5\\n??דירה משופצת מן היסוד בקומה שנייה, מאווררת ומרווחת (70 מ\\\"ר) :\\n??מרוהטת: בכל חדר מיטה, מזגן, ארון, שולחן כתיבה וכיסא\\n??מקרר, כיריים, מכונת כביסה ועוד\\n??11 דק' הליכה מהאוניברסיטה\\n??1 דקה הליכה מ\\\"בר גיורא\\\" ו5 דק מהפאבים/מסעדות במצדה.\\n?? רק 850-950 ש\\\"ח לחדר\\nבבר גיורא פינת רבי-עקיבא\\n\"" );
        serviceConnector.getBridge().newPostFromAdmin( "arnon sturm","דירה מתאימה לזוגות/יחיד- זיסו 7!!!\n\nזיסו 7 (בקרבה לאוניברסיטה) קומה 1 בבית פרטי (ללא גינה) בשכונה ג'. 42 מ\"ר.\nדירת 2 חדרים משופצת ומרוהטת, כולל: מקרר, כיריים גז, סלון, ארון, מזגנים, מיטה, שולחן למידה.\n\nכניסה מיידית!\nשכ\"ד: 1700 כולל ארנונה.\nמותר בעלי חיים!\n\nלפרטים ותיאום הגעה: בן - 050-5470703\n" );
        serviceConnector.getBridge().newPostFromAdmin( "yosi yosi","להשכרה!!\nמתפנה, דירה משופצת ברמה גבוהה, מוארת מאוד (כולל חלונות, ריצוף, מטבח, מקלחת, שירותים, צנרת, מזגנים) מתאימה ל 3 שותפים ביצחק שיפר 4 קומה רביעית. במיקום מעולה, 9 דקות הליכה מהאוניברסיטה משער 90, קרובה לתחבורה ציבורית למרכז מסחרי. הדירה נעימה ומרוהטת. פירוט הריהוט - מקרר חדש , מכונת כביסה חדשה , מזגן חדש, תנור וכיריים, מיקרוגל, שולחן פינת אוכל+ כיסאות, ספות + שולחן בסלון. בכל חדר מיטה מזרן, ארון שולחן. מזגן בכל אחד משלושת החדרים + סלון.\nהמחיר 1,100 ש\"ח לשותף. כניסה מיידי.\nלפרטים: דורון 054-7541707\n" );
        serviceConnector.getBridge().newPostFromAdmin( "avi hayun","** דירת 3 חדרים מרווחת **\nדירה גדולה עם סלון גדול, ושני חדרי שינה שווים בגודלם\nמתאימה לשותפים, לזוג ולמשפחה\nקרובה מאוד למכללת קיי, ומרחב נסיעה של כ- 10 דק' מהאוניברסיטה\nריהוט כמעט מלא\nכתובת: בעלי התוספות 22, שכונה ד'\nמחיר: 2000 ש\"ח\nפרטים נוספים בפרטי\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dudu namer","מראה היום ב17:00 להשכרה דירת 3 חד'\nבשכונה ט' רחבת צפת קומה 2\nבבניין מסודר עם מעלית לכניסה מיידית\n2700 שח 0503403041 עופר\n" );
        serviceConnector.getBridge().newPostFromAdmin("rami gershon","דירת 3 חדרים לכניסה ביום שלישי\n₪2,500 - ‎אוניברסיטת בן-גוריון בנגב‎\n\nלהשכרה כניסה מיידית!\n-דירת קרקע בשכונה ד' על רחוב אברהם אבינו-כיכר האבות\n-חצר פרטית\nשירותים ומקלחת בחדר\n-ריהוט מלא וחדש\n-0525447662\n-2500 לכל הדירה (2 שותפים)\n" );
        serviceConnector.getBridge().newPostFromAdmin( "shimon gershon","*** דירה משופצת ליחיד/לזוג במקום מרכזי רק ב1700**\n\nדירה מקסימה כ-35 מ\"ר בארלוזורוב 4/4 קומה שנייה.\nמתחת לדירה- מאפיה, מכולת, תחנת אוטובוס, 7 דקות מסורוקה ו10 דקות מהאוניברסיטה.\nבנוסף יש גם מרפסת מגניבה ??\nהדירה מרוהטת חלקית אך בעל הדירה גמיש לעזרה.\nכניסה- ב1.11.\nלפרטים נוספים ותיאום מראש- זמינים בוואטאפ:\nספיר- 0505359900\nשירן- 0507914455\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ben caspit","יחידת דיור יפהפיה,\nמשופצת מהיסוד,\nברחוב שאול המלך 93,\nשכונה ו' החדשה,\nמרוהטת קומפלט ומאובזרת,\nקומה 4.\nכניסה מיידית.\nשכ\"ד 2300 כולל ארנונה ומים.\nלפרטים- אדוארד 0503133399\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dalia rabinovich","רק 800 ש\"ח לשותף בדירת 3 שותפים!\nכל הדירה פנויה.\n4 חדרים ברחוב משעול ביתר- מרחק 12 דקות הליכה מהאוניברסיטה.\nכל החדרים מרוהטים - מיטה, ארון ושולחן כתיבה. באחד החדרים יש מרפסת.\n85 מ\"ר.\nשכ\"ד לכל הדירה- 2400 ש\"ח.\nכניסה מיידית.\n0503133399\n" );
        serviceConnector.getBridge().newPostFromAdmin("yosi aboksis","לטודנטים ,קרוב לוינגייט,דירת קרקע,+ מרפסת עצומה וחצר בדו קומתי, קלישר דירת 4 חדרים +שני חדרי שירותים ,הדירה מרווחת ומוארת אחרי שיפוץ ,מרוהטת מלא, במרחק הליכה של כ- 7 דקות להאוניברסיטה, למרכז הספורט של האוניברטיטה ולתחנת הרכבת .ולסורוקה.מתאימה ל-3 שותפים או לזוג\n.דמי השכירות : 2950 ש\"ח לפרטים: לנייד 0545634377\n" );
        serviceConnector.getBridge().newPostFromAdmin( "shachar hirsh","****מראים היום, תאום בפרטי *********\nהשכרה ,ללא תיווך ,בבר גיורא 9 ,שכונה(ד'), דירת גן,אפשר בע\"ח.\nדירת גן עם חצר לזוג/שותפים, 3 חדרים + שרותים ומקלחת בכל חדר.\nהדירה לאחר שיפוץ מלא כולל אינסטלציה , חשמל, ריצוף(גרניט פורצלן) , מזגנים בכל החדרים , ריהוט , מקלחונים , סורגים , פלדלת, דוד שמש וחשמל.\nבסלון- פינת אוכל וכסאות, מקרר, כיריים גז,\nבחדרים- בסיס מיטה זוגית וארון בכל חדר .\nשכד 2200, כולל חצי מחשבון חשמל !. פרטים נוספים בפרטי.\nהגינה פרטית ומגודרת .\nכניסה 1/10\nנא לתאם בפרטי\n" );
        serviceConnector.getBridge().newPostFromAdmin( "niv sela","לכניסה מיידית ל3 שותפים\n₪1,100 - ‎אוניברסיטת בן-גוריון בנגב‎\n\nלכניסה מיידית דירת 4 חדרים בשכונה ד' על גבול ב'\nרחוב סמטת יהונתן ל3 שותפים\n1100 לשותף\nמרוהטת קומפלט\nכמו בתמונות\n-לתיאום 0525447662\n" );
        serviceConnector.getBridge().newPostFromAdmin( "omer sela","להשכרה דירת 4 חדרים משופצת ביעקב דורי 13 ב״ש. ללא תיווך!\n***3000 לכל הדירה -מתאימה ל3 שותפים***\n קומה 3/4 בלי מעלית כולל מחסן פרטי בקומת קרקע.\nהדירה מרווחת ומרוהטת לגמרי, הכל חדש! מכונת כביסה, גז, מקרר, ספה, ארונות, מזגן בכל חדר, טלוויזיה ״43 , מיטות ומזרנים.\n לכניסה מיידית\nלפרטים נוספים אייל 0506533911\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dani danon","להשכרה בשכונת ו' החדשה!\n??ללא עמלת תיווך!!!??\n\nברחוב מבצע נחשון (בפינת הרחובות מצדה - יהודה הלוי)\nדירת 4 חד'\n90 מ\"ר\nקומה 4\n???משופצת ומרוהטת\n???ממוזגת (מזגן בכל חדר ובסלון)\n???בניין מסודר ונקי עם ועד בית\nהדירה קרובה להכל (ממש במרכז העיר!!)\n\nמחיר ?? 2700 ש\"ח\nלפרטים נוספים ולתאום\n????????????????\n053-2787802\n" );
        serviceConnector.getBridge().newPostFromAdmin("roni rahav","חדשה להשכרה בבלעדיות\n\n??במגד העיר\n??דירת 5 חד'\n??חדשה מקבלן\n??2סוויטות הורים\n??מרפסת שמש\n??מחסן\n??מגדל יוקרה.לובי ברמה גבוהה\n??חדר כשר בבנין\n??ממול בית חולים סורוקה\n??כמה צעדים ממרכז הנגב\nחובה לראות\nלפרטים וסיור בנכס: מאגר נכסים\nגולי אזולאי נציגת שרות  0503336803??\n" );
        serviceConnector.getBridge().newPostFromAdmin( "yair role","*** להשכרה***\nדירהת 2 חדרים משופצת ברחוב גיורא יוספטל 26 בכניסה של באר שבע מצפון בסמיכות למרכז אורן 7 דקות הליכה מהאוניברסיטה סביבה שקטה מתאימה לזוג ו\\או לשני שותפים ,משופצת במלואה, מחיר 1700 ש\"ח.\nבדירה יש מקרר,שולחן מתקפל פינת אוכל,כיריים חשמליות וגז ,ארון קיר דלתות כפולות,מיטה זוגית,שידת טלויזיה +כונניות,מזגן, 2 ספות ושולחן\nאמנון -054-3406666\n" );
        serviceConnector.getBridge().newPostFromAdmin("shavit tamir", "להשכרה ללא עמלת תיווך! שכונה ה' רחוב טבנקין דירת 3 חדרים 84מ\"ר ק.1. סלון גדול, מטבח גדול וחדש, חדר רחצה חדש, חדרי שינה מרווחים בדירה יש שני ארונות בגדים כל השאר ללא ריהוט! דירה מדהימה, יש חניה עם גישה נוחה, שכ\"ד 2500 ש\"ח כניסה בינואר 2018 פרטים נוספים בנייד:\n054-5533351 יריב.\n" );
        serviceConnector.getBridge().newPostFromAdmin( "tamir nofar", "שלום לכולם,\nמחפש שותף לדירה ליד שער 90 חצי דקה מהאוניברסיטה\nממש ליד השניצלה\nהדירה במצב מעולה, נקייה, גז תנור מקרוגל מחסן טלוויזיה וממיר וכמובן מכונת כביסה. הכל מוכן.\nבעלת דירה נחמדה, כניסה מיידית עד אוקטובר\nלפרטים 0546310727\n");
        serviceConnector.getBridge().newPostFromAdmin( "user one", "להשכרה (ללא תיווך) דירת 5 חדרים חדשה ומושקעת מאביסרור ברמות החדשה, קרוב ליציאה מהעיר, קומה 5 עם מעלית .\nהחדרים כוללים יחידת הורים וחדר מתבגר/אורחים עם מקלחת ושירותים צמודים. מטבח משודרג, דלתות פנדור מעוצבות בכל הדירה, מזגנים בכל החדרים, מרפסת שמש עם נוף פתוח, 2 חניות פרטיות.\nכניסה גמישה החל מינואר\nלפרטים נוספים: יקיר - 0502750090\n" );
        serviceConnector.getBridge().newPostFromAdmin( "user tow", "להשכרה דירת 4 חדרים רק ב2,300 ש\"ח.\n\n ברחוב הכ\"ג פינת הלפרין, שכונה ג'.\n\n*96 מ\"ר\n*קומה 3\\3\n*ממוזגת\n\nהדירה מוארת, גדולה ומרווחת להפליא. מתאימה למשפחה, לשותפים או לסטודנטים.\n\nמיקומה הנפלא של הדירה הנ\"ל בעצם מאפשרת הגעה לכל מקום מרכזי וחשוב לתושב העיר, בצעידה של כרבע שעה - מתחם הקניות ביג, קניון הנגב, התחנה המרכזית, בניין המכינה של בן-גוריון, אוניברסיטת בן-גוריון.\n\nריהוט: קומפלט פרט למכונת כביסה\n\nלפרטים: 054-449-0025\n" );
        serviceConnector.getBridge().newPostFromAdmin( "user user", "קוטג' ברמות להשכרה רק ב2,900 ש\"ח!!!\n\n2 חדרי שינה וסלון\n\nהקוטג' מתאים למשפחות, סטודנטים, שותפים או לזוגות.\nמדובר בשכונה הישנה של רמות.\n\n* כניסה מיידית!!!!!\n* 80 מ\"ר\n* דוד חשמל ושמש\n* גינה ענקית (170 מ\"ר)\n* מזגן בכל חדר\n\nריהוט: ספות 2+3, שידה, שולחן סלון, מיקרוגל, 2 ארונות 4 דלתות, מיטה זוגית+שידות.\n\nלפרטים: 054-449-0025\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dan arieli", "להשכרה קוטג' 3 חדרים בשכונת נחל עשן\n\nממוזגת\nמשופצת\nכניסה מיידית\n65 מ\"ר\nגינה 230 מ\"ר\n\nריהוט: מקרר.\n\nמחיר: רק ב3,500.\n\nטלפון: 052-477-8940\n" );
        serviceConnector.getBridge().newPostFromAdmin( "dor ashkenazi", "שותף (סטודנט) מחפש 2 שותפים נוספים לדירת 4 חדרים\nשכ״ד לכל חדר - 900 ש״ח\nהדירה היא ברחוב יואל השופט 2 - 5 דקות הליכה מהאוניברסיטה ו5 דקות הליכה ממרכז אורן!\nהדירה משופצת, נעימה ואידיאלית לסטודנטים\nמבחינת ריהוט יש הכל כולל הכל: ספות, שולחן אוכל קטן + 2 כסאות, שולחן סלון, טלוויזיה, מקרר, מיקרוגל, טוסטר אובן, כיריים גז ומכונת כביסה.\nבכל חדר: מזגן, מיטה, מזרון, שולחן כתיבה, כסא וארון\n\nכניסה מיידית אז מוזמנים לפנות אליי בפרטי :)\n" );
        serviceConnector.getBridge().newPostFromAdmin( "shachar hasson", "להשכרה דירת קרקע 2 חדרים מזגנים בכל הבית רהוט מלא מכונת כביסה מקרר תנור משולב עם גז סלון ועוד... רחוב בר גיורא 7\n חמש דקות מהאוניברסיטה\n1700 בלבד לחודש\nפינוי גמיש 0522623356\n" );
        serviceConnector.getBridge().newPostFromAdmin( "adi ashkenazi", "נותר חדר אחרון הכולל מקלחת ושרותים צמודים!\nברחוב השלום 20...עם עוד 2 שותפים...\nהדירה ממוקמת מול בת דור ובקרבת בית הספר למשחק ,מרכז מסחרי והמכינה של בן גוריון... הדירה נמצאת בלב העיר וקרובה כמעט להכל כדאי לבוא להתרשם נעשה שיפוץ בסטנדרטיים גבוהים!..החדר כולל טלוויזיה LCD 32 אינצ' מיטה זוגית+מזרן ארון בגדים,מקרר מיני בר ושולחן כתיבה...כניסה מיידית\nמחיר לחדר 1200 שח גמיש למהירי החלטה.\nלפרטים 0524601230 או בפרטי\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ron shoval", "רוצים לחנוך דירה חדשה דנדשה?! אברהם אבינו 14 פינת אלכסנדר ינאי קומה 1. מנעול בכניסה לבניין 80 מטר ל3 שותפים מחיר 1050 לשותף כמובן שגם ריהוט כלול כניסה באמצע חודש 10 תשלום החל מחודש 11. לפרטים 0532731622\n" );
        serviceConnector.getBridge().newPostFromAdmin( "yuval mendelson", "להשכרה דירת 2.5 ח\"ד\n\nשכונה ד', רח' אלעזר בן יאיר\n\n*משופצת\n*מזגן בכל חדר\n*קומה 3\\1\n\nריהוט: מקרר, ארון 3 דלתות.\n\nכניסה מיידית\n\nמחיר: 2,000 ש\"ח.\n\nלפרטים: 054-449-0025\n" );
        serviceConnector.getBridge().newPostFromAdmin( "arkadi dochin", "להשכרה יחידת דיור 3 חד' כולל מים וארנונה ב-2,100 ש\"ח\n\nשכונה ג', רח' קלישר 54\nמרחק הליכה קצר לאוניברסיטת בן גוריון\n\n*משופצת\n*מזגן בכל חדר (3 מזגנים)\n*קומה 3\\3\n*יש תשתית אינטרנט של חברת Unlimited!!!\n\nריהוט: עפ\"י דרישה.\n\nכניסה מיידית.\n\nלפרטים: 054-449-0025\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ronen bobo", "נותרו שני חדרים אחרונים !!\nברחוב השלום 29\nהדירה הינה דירת סוייטות מרווחת ומאובזרת(כל חדר מקלחת ושירותים) המיועדת ל3 שותפים\nשני חדרים שנותרו חדר רגיל (1150) וחדר ענק הכולל סלון (1300 ש\"ח לחודש כבר )\nבכל חדר שולחן לימוד+כסא,ארון, מיטה זוגית+מזרן וטלוויזית LCD.\nקיים מרחב משותף(מטבח סלון ופינת אוכל) הכולל סלון,שולחן סלוני,מקרר,טוסטר,מיקרוגל טלוויזיה ומכונת כביסה.\nהדירה בת כ90 מ\"ר בקומה ג' וממוקמת ליד בת דור ,בסמוך לבית הספר למשחק והקמפוס האקדמי של בן גוריון ובמרחק הליכה ממרכז מסחרי בו ניתן למצוא הכל.\nמיקום מרכזי ביותר ונגיש,בלוק וכניסה סטודנטיאלית וצעירה.\nלפרטים נוספים ותיאום 0524601230\nתינתן הנחה לבאים כקבוצה ולמהירי החלטה\n" );
        serviceConnector.getBridge().newPostFromAdmin( "sara aharon", "**עדין רלוונטי! - ללא תיווך**\nהתפנתה דירה משופצת מוארת ומדהימה!\nמיקום מעולה - וינגייט שקטה ליד סורוקה והאוניברסיטה\n1000 לכל שותף\nירקן וסופר מעבר לכביש\nשלושה חדרי שינה שווים ומרווחים, בכל אחד ארון, מיטה, שולחן, מזגן וחלון\nמרחב משותף רחב ונעים, מטבח מאובזר כולל מקרר, פינת אוכל מרווחת\nשירותים ומקלחת נפרדים\nמכונת כביסה\nבעל דירה נוח!\nבר 0584050960\nיכולים להתקשר גם אלי-\nשיר 0506966516\n" );
        serviceConnector.getBridge().newPostFromAdmin( "margalit zhanani", "להשכרה בדרך מצדה\n₪2,700\n\nכתובת :דרך מצדה 95, קומה 2\n75 מטר נטו.\nמקום שקט ובטוח,יש שערים עם מפתח בכניסה לבניין\nדירת ארבעה חדרים-שלושה חדרי שינה, סלון מרווח ומואר,מטבח וחדר שירות.\nעברה שיפוץ כולל לפני שנה וחצי.\nכניסה מיידית\nמזגן בסלון+בשני חדרי שינה.\nהדירה מושכרת עם תנור משולב כיריים+מקרר חדשים.\nהדירה לא מרוהטת והמחיר לא כולל חשבונות.\nיש וועד בית.\n052-6035054 גיל.\n" );
        serviceConnector.getBridge().newPostFromAdmin( "ben osor", "להשכרה במיתר יחידת דיור בשכונת רבין.\n70 מ\"ר + חצר פרטית + מחסן ומזווה חיצוני.\nנמצאת במקום מרכזי, קרובה לבתי הספר ולמרכז המסחרי של הישוב.\nשני חדרי שינה, מטבח, סלון ושני חדרי שירותים.\nיחידה יפה ומושקעת, בית אבן וגינה גדולה, יפה ומטופחת.\n\nמחיר 2700 ₪\nכדאי לראות.\n\nלפרטים -\nמאיר - 0525816460\nכרמלית - 0525816440\n" );
        serviceConnector.getBridge().newPostFromAdmin( "rivka tamir", "***להשכרה ברחוב דונקלבלום 1 ב-ו' החדשה***\nדירת 4 חדרים משופצת מהיסוד!!\n-חדר הורים עם שרותים ומקלחת\n-בניין מתוחזק ברמה יוצאת דופן.\n-חניה+מחסן\n-ריהוט: פינת אוכל, 2 מיטות יחיד, 2 ארונות עץ מלא, ארון הזזה עם טריקה שקטה, 2 שידות עץ מלא, כריים, תנור, שולחן סלון, מזנון.\nכניסה: 14/11\nמחיר: 3400\nטלפון לפרטים: 0542054048 יעקב\n" );
        serviceConnector.getBridge().connectToTestDB();
    }

    @AfterClass
    public static void endup() {
        serviceConnector.getBridge().disconnectToTestDB();
    }

}
